{"data":{"logo":{"childImageSharp":{"fixed":{"base64":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAECAYAAACOXx+WAAAACXBIWXMAAA7EAAAOxAGVKw4bAAAA30lEQVQY022PuwrCMBhG00FRUIsKQi04iJfJC0IFxUXUQRB0EaFjW1ycfATfwIdwUJ9AbRYnSQcXX8hT7KBg4JD8+ZKTP+J2smK3s5U+7IUWyHVC+a4uvobyvYz4MwLppZT0mszaT4DQRri8HNvD531rKN+ZKukWOVjnQgka1I1AurWIHiSgyhk7+GQdaENTXE/WBuHweuysXo+djrCHoEvoIGvR4Yx6zOUc8wLCBwv8JM/eJKoHMId+2KGFcISwijCOsEKQQxh2mEWoq083dTDYqyDTIEltkpnRukxmvAF42IswAodQPwAAAABJRU5ErkJggg==","width":400,"height":89,"src":"/static/9efd9cc23dfa9a8aa5bd4f6570289133/51380/title-logo.png","srcSet":"/static/9efd9cc23dfa9a8aa5bd4f6570289133/51380/title-logo.png 1x,\n/static/9efd9cc23dfa9a8aa5bd4f6570289133/240c8/title-logo.png 1.5x,\n/static/9efd9cc23dfa9a8aa5bd4f6570289133/f5cf3/title-logo.png 2x"}}},"markdownRemark":{"html":"<h2>We all know a change is coming</h2>\n<p>Over the winter break, my partner and I took the time to expansively map out the factors and possibilities of the coming century. This swept across the spectrum of developments in our own paths, our relationship, and the wider field of the world around us.</p>\n<p>It is exciting to deeply plan out things, with someone you love and so dearly care for!</p>\n<p>I relish the chance to do some research and make forecasts about the various possibilities ahead. While the specific permutations of opportunities, happenstances and setbacks that will pop up in our daily lives are unknowable, there is still a yearning for and value in trying to forecast and navigate the currents of uncertainty in global trends. Some of the tools I lean on to consider this include: <a href=\"https://fs.blog/2018/05/probabilistic-thinking/\">probabilistic thinking</a>, tips from Philip Tetlock’s <a href=\"https://amzn.to/2LF2q8h\">Superforecasting</a>, and a grab-bag of techniques I picked up while working in the intelligence community. I am grateful for my time in the community instilling some important lessons in me:</p>\n<ul>\n<li>We can only make decisions based on the information that we hold at the time a decision needs to be made. And while retrospectives are useful learning exercises, emotionally and spiritually we have to come to a place of peace with what decisions we have made in the past. </li>\n<li>If there is information that we do not have, are there proxies we could use to get indirect understanding of a situation?</li>\n<li>Certainty makes our arguments more persuasive, however that does not make the outcomes or reality we predict any more certain. Being able to accurately convey uncertainty (vs doubt and apprehension) is a challenging but vital matter when sharing your forecasts and analyses with others. And as listeners, we should ask how someone is factoring in probability and uncertainty in their arguments.</li>\n</ul>\n<p>What was the big thing we came away with from our planning and forecasting? The excitement of mapping out our desired adventures and possibilities, and the harsh interjection of climate chaos into that. While I have been tracking climate developments in an ad hoc fashion for some time, this was the first time of really digging into different angles, aspects and models for what is happening with the ecosystem. </p>\n<blockquote>\n<p>In short, the world ‘as we know it’ will end.</p>\n</blockquote>\n<h2>Observing the Context</h2>\n<p>To be clear, this end is not the death of humanity per se; but it is the end of our current relationship to the earth, of current economics, consumption, energy and pollution. And it will end either by a radical transformation of society and the global economy or ‘the end’ will be forced upon us by systemic failures of economies and societies across the globe (bought on by ecosystem collapse, more frequent ‘natural’ disasters/harvest failures, and increasing competition for resources/water/land). Forecasts need specific conditions, distinct time limits and defined probabilities in order for them to be fairly evaluated/judged in the future. Defining what conditions meet the the-world-as-we-know-it-will-end criteria is not very specific with my description so far but I can offer some initial time limits and defined possibilities to begin with, and see if I update over the course of detailing my thoughts.</p>\n<p>To begin, the chance of the-world-as-we-know-it-will-end if we stick to current policies is:</p>\n<ul>\n<li>90% by or before 2100</li>\n<li>70% by or before 2090</li>\n<li>53% by or before 2080</li>\n<li>35% by or before 2070</li>\n<li>28% by or before 2060</li>\n<li>22% by or before 2050</li>\n<li>17% by or before 2040</li>\n<li>12% by or before 2030</li>\n</ul>\n<p>These are somewhat nebulous forecasts by their nature, due to the scale of factors and complexity of their inter-relation; they are certainly not built up from the ground level on quantified data. Primarily they integrate the ‘transformation by choice’ and the less desirable ‘transformation by collapse’ outcomes. I am rating the likelihood of radical transformation as low throughout the whole century, decreasing as we approach the end of the century. Largely because it is systematically challenging to achieve, and then later in the century it will be too late to avoid ‘transformation by collapse’ (although still worth it to soften the blow). Getting every major polluting nation to radically shift their behavior, requires practically each of them to come to that place via their internal politics (since international coordination continues to be sorely hampered). It’s a lot of separate battles that need to be won, and we are still in a serious hole if even a handful continue to pollute. This <em>could</em> be mitigated if other polluters go beyond zero net emissions to significant net negative emissions. ‘Transformation by collapse’ encapsulates a network of interconnected outcomes; famine from multiple ‘breadbasket’ failures, conflicts over resources, ecosystem failure, large scale geopolitical conflicts going ‘hot’, higher frequency of ‘natural’ disasters, migration/displacement pressures triggered by all of the above. The criteria for ‘transformation by collapse’ is the partial or full failure of the international political and economic order; a sustained break-down in globalized trade (including prolonged global depression), globalized political stability or a large proportion (50%+) of the world in sustained conflict and/or sustained economic depression.</p>\n<p>On a side note, ‘transformation by technical salvation’ is also factored in, integrated into the ‘transformation by choice’ outcomes. Geo-engineering schemes tend to require serious coordination and resources, with a mix of projected pay-offs (but I still won’t discount the possibility of a well-resources rogue actor from trying; eg China dumping tons of iron oxide into the distant seas). Similarly, ‘no transformation but no problems’ outcomes (if we really whiffed on the science or modelling) are accounted as a very low chance (x &#x3C; 1%). We have a <a href=\"https://www.carbonbrief.org/qa-how-do-climate-models-work\">fairly sizeable handle on the major mechanisms</a> at play here and it is unlikely there is some unknown planetary buffer that will magically stop greenhouse effects from warming and destabilizing the climate.</p>\n<p>Ideally, I would break this overall forecast down into a series of more defined and discrete forecasts, (<a href=\"https://aiimpacts.org/evidence-on-good-forecasting-practices-from-the-good-judgment-project-an-accompanying-blog-post/\">one of the many tips coming out of forecasting science</a>). These would be used to refine the overall forecast and to update it over time. I may yet find time to delve deeper into a full forecasting project. I have recently read up on various topics around climate modeling, the carbon cycle, the glaciation cycle, negative emission technologies, questions around methane’s role, and more. Each of these could be worthwhile sources of forecasting questions. As a lazy but researched proxy, I can use the periodic IPCC models to gauge how countries are performing now and what projected average global temperature will result. The next IPCC report (6th generation) is due out 2021 but some <a href=\"https://www.carbonbrief.org/guest-post-why-results-from-the-next-generation-of-climate-models-matter\">preliminary modelling is available</a>. It does not look good for those wanting to avoid collapse :( The new modeling predicts 2.8°C to 5.8°C of warming by 2100, compared to the 2014 5th generation modeling, which predicted 2.1°C to 4.7°C.</p>\n<p>One compact data point that illustrates our situation starts with the analysis that we were due to enter a glaciation period. <a href=\"https://www.nature.com/articles/529162a\">Ganopolski et al</a> model that without human agricultural practices, CO<sub>2</sub> would have only been 240 parts per million around 1800, before the onset of industrialization. CO<sub>2</sub> at 240 ppm would have seen the return of a glaciation period, given the changes to earth’s orbit. However, human activity pre-industrialization had already boosted CO<sub>2</sub> to 280 ppm, enough to delay the onset of the next glaciation period by at least 50,000 years. Glaciation would slowly (over 10,000 to 20,000 years) lead to an ice age, with average surface temperature reductions of 8-12°C. Today, CO<sub>2</sub> is over 415 ppm and increasing, the highest concentration it has been in 8 million years. An extra 40 ppm, if stretched over ten to twenty thousand years, would have allowed us to skip an ice age. We are now 135 ppm over that ‘avoid the next ice age’ level and this amount of CO<sub>2</sub> (and other greenhouse gases) in the air will slingshot us into significant warming in the near-term (this century), even if we stopped all human emissions today.</p>\n<h2>Orientation</h2>\n<p>So, what courses of action are left for individuals, communities and larger political entities that are open to understanding our predicament? Since sitting with my partner, developing our own plans, I have continued to return to a few encompassing mindsets that help me categorize how folks are orienting themselves to the big picture. This in turn informs and interacts with how one is orientated, and what courses of actions are available to us.</p>\n<p> The main two of these mindset concepts I have been returning are “Big Civilization” and “Little Civilization”. In essence, “Big Civ” represents the continuation (via maintenance, transformation and salvation) of our globalized, urbanized, industrialized way of life. And “Little Civ” represents whatever can be held on to in a world that is increasingly destructured; deglobalized, deurbanized, deindustrialized, and in worse case scenarios, depopulated. A world that requires much more self-sufficiency. “Big Civ” and “Little Civ” are orientations that can be applied to other civilizational crisis: the threat of nuclear war or WWIII; global pandemics; general threats of economic instability arising from inequality; an asteroid forecast to hit earth in 50 years time; you name it. For this post and most of my thinking around these orientations, I am focusing on climate chaos as the crisis at hand.</p>\n<h4>Big Civilization</h4>\n<p>“Big Civ” is built on the assumption or hope and optimism that 1) Things are fine the way they are 2) things are not great but we can turn it around, and 3) things are bad but if we really dig in, we can still turn things around. “Turning it around” in a climate context boils down to a range of interventions that involve carbon emission reductions, coordinated political action and/or savvy innovation. Many of the IPCC’s <a href=\"https://www.carbonbrief.org/qa-how-integrated-assessment-models-are-used-to-study-climate-change\">integrated assessment models</a> (IAMs), are projected pathways to lower or limit warming by the end of the century; examples of efforts to save “Big Civ”. </p>\n<p>For individuals and organizations, there are things that ‘make sense’ based on the forever continuation of “Big Civilization” (assuming you can do more than just survive): Building your retirement savings; Investing in skill-sets useful in a globalized economy, such as software engineering; buying urban property; mortgages, savings, banking services; assuming there will be someone to rent or sell your investment property to in the future; building your social media ‘brand’; out-sourcing as much as you can to the market (cleaning, cooking, maintenance, etc); buying stocks; setting businesses based on tourist dollars; and much more. This is not dependent on explicit reasoning; often it can simply be the linear extrapolation of how things are today.</p>\n<h4>Little Civilization</h4>\n<p>“Little Civ” is a mindset that springs from beliefs or assumptions such as 1) things will not last the way things are 2) Even if we started trying to “turn things around”, there might be a long period before we get things under control and return to our current levels of (uneven) prosperity 3) It is too late to truly turn things around. Again, this mindset does not have to be based on explicit reasoning, and does not need to be limited to climate issues. Arguably ‘preppers’ are the most well-known believers of the “Little Civ” mindset, without needing a shared civilization crisis they are all preparing for.</p>\n<p>Again, there are things that ‘make sense’ based on the risk or ‘inevitability’ that things are going to fall apart: developing food/water/power self-sufficiency; relying more on local economies; making emergency action plans for crisis moments; focusing social bonds in your immediate community; building up stocks of emergency supplies; taking resources out of the global economy and investing locally. Examples specifically from a climate perspective include: building sea walls to protect bays against rising water levels; moving housing away from flood/fire/storm areas; and numerous adaptions of the generic “Little Civ” </p>\n<p>So, the courses of action that individuals, communities and organizations will consider taking are shaped by their own orientations (explicit or not) around “Big Civ” and “Little Civ”. Additionally when considering collective action, sensible actors should also identify and consider the orientations of other actors; what mindsets are others bringing into their decision-making? To be explicit, if a collective action makes sense in one orientation but not another, it is an uphill struggle to get folks that hold different orientations to invest in the collective action; There needs to be some alignment on orientation for that to even be considered.</p>\n<p>To reiterate, while I am talking about climate chaos and its impact on how folk take on “Big Civ” or “Little Civ” orientations, these orientations are separate from climate issues: One can orient as “Little Civ” because one believes, for example, that a zombie outbreak, alien invasion or nuclear war are just around the corner.</p>\n<p>Before moving on to some nuances though, I want to state some broad assertions:</p>\n<ul>\n<li>Most of us (myself included) are currently anchoring our actions from a “Big Civ” orientation;</li>\n<li>For that majority, considering “Little Civ” as an orientation can feel like facing death; the death of our world-orientation, our world-frame. Climate chaos is increasingly forcing folk to face the possibility that “Big Civ” will unravel.</li>\n<li>This felt sense of ‘facing death’ can drive us to denial, nihilism and fatalism, with two common varieties: we build elaborate rationalizations for how the scientific consensus is either a hoax, wrong or not as bad as it seems; or we acknowledge the consensus and then avoid reading about it or thinking about the future, often with background sense of gnawing dread.</li>\n<li>If “Little Civ” futures are possible, than this denial will stop us from preparing for them.</li>\n</ul>\n<h4>A few nuances</h4>\n<p>“Little Civ” and “Big Civ” do not capture the whole range of big-picture orientations. They <em>are</em> the main thrust of this piece but there are two other orientations that encompass a range of other behaviors and mindsets that I want to quickly address. These two other useful orientations are “Survival” and “Next Civilization”.</p>\n<p>Acknowledging “Survival” as an orientation is acknowledging that there are many folk in the current system that are mentally or materially in a survival situation, where their behavior, thinking and actions are short-term, constrained and reactionary. Example populations in “Survival” orientation include: refugees, subsistence farmers in famine areas, folks impacted by natural disasters, some workers stripped of jobs via the globalized economy, some folks in highly oppressed identity groups, some of the folks in dire poverty in industrialized countries, and some ‘wage slaves’. These groups are less able to control or shape their fate. Note, each individual in these groups will face their own battle with slipping into “Survival” mode when their external conditions degrade; Some of them manage to maintain agency or a broader orientation. Globally, the “Survival” population exist as a challenge for societies today, one that we are largely failing.</p>\n<p>“Next Civilization” is a catch-all; for those orientations that are yearning for the next thing, beyond “Big Civ”. These orientations are united in seeing flaws in the current “Big Civilization” and seek to replace or evolve past it with a different, “better” paradigm. “Better” here is self-defined by the adherents of different forms of “Next Civ”, and can easily be in opposition to one another. Examples of “Next Civ” include decentralized crypto-currency adherents, meta-modernists, radical christian theologists, misogynist white supremacists, actual socialists (not just mislabeled social democrats) and a host of others. Many “Transformation by choice” climate outcomes would be deeply entwined with environmentally focused “Next Civ” ideas, and other “Next Civ” ideas would arguably be distractions from avoiding climate-related collapse.</p>\n<h4>How we arrive at an orientation</h4>\n<p>For most of us, what mix of “Big Civ”, “Little Civ” and other orientations one carries comes down to our processing of life-experiences, desires, risk, fear, community, and the narratives and tidbits of information we absorb through conversations and media (all medias: social, news, academic, entertainment, etc). While there will always be a subconscious processing aspect of our civilizational orientation, researching, gaining awareness and forming forecasts are ways we can be more explicit and precise about our orientation.</p>\n<p>The winter break planning and research session certainly pushed my partner and I to face the higher possibility of “Little Civilization” futures. My implicit orientation previously would have been a mix of implicit “Big Civ” and more explicitly, various strands of “Next Civ”. I have been sober about the significant reluctance of governments, societies and “the market” to effectively address climate matters, despite legitimate successes such as the Montreal Protocol on CFCs. “Big Civilization” almost did address the climate challenge, <a href=\"https://www.nytimes.com/interactive/2018/08/01/magazine/climate-change-losing-earth.html\">in the 1980s</a> but we fumbled and haven’t come as close since. What I did not seriously appreciate was the translation of numbers like “2-3 degrees of warming by 2100” into tangible impacts in our coming century, nor did I have an appreciation of how there were legitimate risks of even higher levels of warming by 2100. While I am still invested in “Big Civ” avoiding collapse, considering how I can prepare for “Little Civilization” scenarios is now part of my decision-making hedges regarding the future. I expect this to change over the coming years, for better or for worse, depending on how the planet and humanity collectively responds to this human-created climate challenge.</p>\n<blockquote>\n<p>Of course, hedging one’s orientation comes at a cost</p>\n</blockquote>\n<h6>The challenge of the “Yes, No, Maybe” brain</h6>\n<p>Narrative forcing of the brain </p>\n<h2>Decision</h2>\n<h6>Risk factors and leverage points</h6>\n<ul>\n<li>Increasing proportion of the globe in “Survival” mode</li>\n<li>What happens with deforestation in Brazil</li>\n<li>What happens with big emitters/consumers, particularly the USA, China and Europe</li>\n<li>What happens with arctic ice</li>\n<li>Methane</li>\n<li>Large Power conflict</li>\n<li>Negative emissions technology</li>\n<li>Geo-engineering; political and technological change</li>\n<li>Nuclear power; political change</li>\n</ul>","htmlAst":{"type":"root","children":[{"type":"element","tagName":"h2","properties":{},"children":[{"type":"text","value":"We all know a change is coming"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Over the winter break, my partner and I took the time to expansively map out the factors and possibilities of the coming century. This swept across the spectrum of developments in our own paths, our relationship, and the wider field of the world around us."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"It is exciting to deeply plan out things, with someone you love and so dearly care for!"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I relish the chance to do some research and make forecasts about the various possibilities ahead. While the specific permutations of opportunities, happenstances and setbacks that will pop up in our daily lives are unknowable, there is still a yearning for and value in trying to forecast and navigate the currents of uncertainty in global trends. Some of the tools I lean on to consider this include: "},{"type":"element","tagName":"a","properties":{"href":"https://fs.blog/2018/05/probabilistic-thinking/"},"children":[{"type":"text","value":"probabilistic thinking"}]},{"type":"text","value":", tips from Philip Tetlock’s "},{"type":"element","tagName":"a","properties":{"href":"https://amzn.to/2LF2q8h"},"children":[{"type":"text","value":"Superforecasting"}]},{"type":"text","value":", and a grab-bag of techniques I picked up while working in the intelligence community. I am grateful for my time in the community instilling some important lessons in me:"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"ul","properties":{},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"We can only make decisions based on the information that we hold at the time a decision needs to be made. And while retrospectives are useful learning exercises, emotionally and spiritually we have to come to a place of peace with what decisions we have made in the past. "}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"If there is information that we do not have, are there proxies we could use to get indirect understanding of a situation?"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Certainty makes our arguments more persuasive, however that does not make the outcomes or reality we predict any more certain. Being able to accurately convey uncertainty (vs doubt and apprehension) is a challenging but vital matter when sharing your forecasts and analyses with others. And as listeners, we should ask how someone is factoring in probability and uncertainty in their arguments."}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"What was the big thing we came away with from our planning and forecasting? The excitement of mapping out our desired adventures and possibilities, and the harsh interjection of climate chaos into that. While I have been tracking climate developments in an ad hoc fashion for some time, this was the first time of really digging into different angles, aspects and models for what is happening with the ecosystem. "}]},{"type":"text","value":"\n"},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"In short, the world ‘as we know it’ will end."}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h2","properties":{},"children":[{"type":"text","value":"Observing the Context"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"To be clear, this end is not the death of humanity per se; but it is the end of our current relationship to the earth, of current economics, consumption, energy and pollution. And it will end either by a radical transformation of society and the global economy or ‘the end’ will be forced upon us by systemic failures of economies and societies across the globe (bought on by ecosystem collapse, more frequent ‘natural’ disasters/harvest failures, and increasing competition for resources/water/land). Forecasts need specific conditions, distinct time limits and defined probabilities in order for them to be fairly evaluated/judged in the future. Defining what conditions meet the the-world-as-we-know-it-will-end criteria is not very specific with my description so far but I can offer some initial time limits and defined possibilities to begin with, and see if I update over the course of detailing my thoughts."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"To begin, the chance of the-world-as-we-know-it-will-end if we stick to current policies is:"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"ul","properties":{},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"90% by or before 2100"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"70% by or before 2090"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"53% by or before 2080"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"35% by or before 2070"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"28% by or before 2060"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"22% by or before 2050"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"17% by or before 2040"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"12% by or before 2030"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"These are somewhat nebulous forecasts by their nature, due to the scale of factors and complexity of their inter-relation; they are certainly not built up from the ground level on quantified data. Primarily they integrate the ‘transformation by choice’ and the less desirable ‘transformation by collapse’ outcomes. I am rating the likelihood of radical transformation as low throughout the whole century, decreasing as we approach the end of the century. Largely because it is systematically challenging to achieve, and then later in the century it will be too late to avoid ‘transformation by collapse’ (although still worth it to soften the blow). Getting every major polluting nation to radically shift their behavior, requires practically each of them to come to that place via their internal politics (since international coordination continues to be sorely hampered). It’s a lot of separate battles that need to be won, and we are still in a serious hole if even a handful continue to pollute. This "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"could"}]},{"type":"text","value":" be mitigated if other polluters go beyond zero net emissions to significant net negative emissions. ‘Transformation by collapse’ encapsulates a network of interconnected outcomes; famine from multiple ‘breadbasket’ failures, conflicts over resources, ecosystem failure, large scale geopolitical conflicts going ‘hot’, higher frequency of ‘natural’ disasters, migration/displacement pressures triggered by all of the above. The criteria for ‘transformation by collapse’ is the partial or full failure of the international political and economic order; a sustained break-down in globalized trade (including prolonged global depression), globalized political stability or a large proportion (50%+) of the world in sustained conflict and/or sustained economic depression."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"On a side note, ‘transformation by technical salvation’ is also factored in, integrated into the ‘transformation by choice’ outcomes. Geo-engineering schemes tend to require serious coordination and resources, with a mix of projected pay-offs (but I still won’t discount the possibility of a well-resources rogue actor from trying; eg China dumping tons of iron oxide into the distant seas). Similarly, ‘no transformation but no problems’ outcomes (if we really whiffed on the science or modelling) are accounted as a very low chance (x < 1%). We have a "},{"type":"element","tagName":"a","properties":{"href":"https://www.carbonbrief.org/qa-how-do-climate-models-work"},"children":[{"type":"text","value":"fairly sizeable handle on the major mechanisms"}]},{"type":"text","value":" at play here and it is unlikely there is some unknown planetary buffer that will magically stop greenhouse effects from warming and destabilizing the climate."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Ideally, I would break this overall forecast down into a series of more defined and discrete forecasts, ("},{"type":"element","tagName":"a","properties":{"href":"https://aiimpacts.org/evidence-on-good-forecasting-practices-from-the-good-judgment-project-an-accompanying-blog-post/"},"children":[{"type":"text","value":"one of the many tips coming out of forecasting science"}]},{"type":"text","value":"). These would be used to refine the overall forecast and to update it over time. I may yet find time to delve deeper into a full forecasting project. I have recently read up on various topics around climate modeling, the carbon cycle, the glaciation cycle, negative emission technologies, questions around methane’s role, and more. Each of these could be worthwhile sources of forecasting questions. As a lazy but researched proxy, I can use the periodic IPCC models to gauge how countries are performing now and what projected average global temperature will result. The next IPCC report (6th generation) is due out 2021 but some "},{"type":"element","tagName":"a","properties":{"href":"https://www.carbonbrief.org/guest-post-why-results-from-the-next-generation-of-climate-models-matter"},"children":[{"type":"text","value":"preliminary modelling is available"}]},{"type":"text","value":". It does not look good for those wanting to avoid collapse :( The new modeling predicts 2.8°C to 5.8°C of warming by 2100, compared to the 2014 5th generation modeling, which predicted 2.1°C to 4.7°C."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"One compact data point that illustrates our situation starts with the analysis that we were due to enter a glaciation period. "},{"type":"element","tagName":"a","properties":{"href":"https://www.nature.com/articles/529162a"},"children":[{"type":"text","value":"Ganopolski et al"}]},{"type":"text","value":" model that without human agricultural practices, CO"},{"type":"element","tagName":"sub","properties":{},"children":[{"type":"text","value":"2"}]},{"type":"text","value":" would have only been 240 parts per million around 1800, before the onset of industrialization. CO"},{"type":"element","tagName":"sub","properties":{},"children":[{"type":"text","value":"2"}]},{"type":"text","value":" at 240 ppm would have seen the return of a glaciation period, given the changes to earth’s orbit. However, human activity pre-industrialization had already boosted CO"},{"type":"element","tagName":"sub","properties":{},"children":[{"type":"text","value":"2"}]},{"type":"text","value":" to 280 ppm, enough to delay the onset of the next glaciation period by at least 50,000 years. Glaciation would slowly (over 10,000 to 20,000 years) lead to an ice age, with average surface temperature reductions of 8-12°C. Today, CO"},{"type":"element","tagName":"sub","properties":{},"children":[{"type":"text","value":"2"}]},{"type":"text","value":" is over 415 ppm and increasing, the highest concentration it has been in 8 million years. An extra 40 ppm, if stretched over ten to twenty thousand years, would have allowed us to skip an ice age. We are now 135 ppm over that ‘avoid the next ice age’ level and this amount of CO"},{"type":"element","tagName":"sub","properties":{},"children":[{"type":"text","value":"2"}]},{"type":"text","value":" (and other greenhouse gases) in the air will slingshot us into significant warming in the near-term (this century), even if we stopped all human emissions today."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h2","properties":{},"children":[{"type":"text","value":"Orientation"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"So, what courses of action are left for individuals, communities and larger political entities that are open to understanding our predicament? Since sitting with my partner, developing our own plans, I have continued to return to a few encompassing mindsets that help me categorize how folks are orienting themselves to the big picture. This in turn informs and interacts with how one is orientated, and what courses of actions are available to us."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":" The main two of these mindset concepts I have been returning are “Big Civilization” and “Little Civilization”. In essence, “Big Civ” represents the continuation (via maintenance, transformation and salvation) of our globalized, urbanized, industrialized way of life. And “Little Civ” represents whatever can be held on to in a world that is increasingly destructured; deglobalized, deurbanized, deindustrialized, and in worse case scenarios, depopulated. A world that requires much more self-sufficiency. “Big Civ” and “Little Civ” are orientations that can be applied to other civilizational crisis: the threat of nuclear war or WWIII; global pandemics; general threats of economic instability arising from inequality; an asteroid forecast to hit earth in 50 years time; you name it. For this post and most of my thinking around these orientations, I am focusing on climate chaos as the crisis at hand."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h4","properties":{},"children":[{"type":"text","value":"Big Civilization"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"“Big Civ” is built on the assumption or hope and optimism that 1) Things are fine the way they are 2) things are not great but we can turn it around, and 3) things are bad but if we really dig in, we can still turn things around. “Turning it around” in a climate context boils down to a range of interventions that involve carbon emission reductions, coordinated political action and/or savvy innovation. Many of the IPCC’s "},{"type":"element","tagName":"a","properties":{"href":"https://www.carbonbrief.org/qa-how-integrated-assessment-models-are-used-to-study-climate-change"},"children":[{"type":"text","value":"integrated assessment models"}]},{"type":"text","value":" (IAMs), are projected pathways to lower or limit warming by the end of the century; examples of efforts to save “Big Civ”. "}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"For individuals and organizations, there are things that ‘make sense’ based on the forever continuation of “Big Civilization” (assuming you can do more than just survive): Building your retirement savings; Investing in skill-sets useful in a globalized economy, such as software engineering; buying urban property; mortgages, savings, banking services; assuming there will be someone to rent or sell your investment property to in the future; building your social media ‘brand’; out-sourcing as much as you can to the market (cleaning, cooking, maintenance, etc); buying stocks; setting businesses based on tourist dollars; and much more. This is not dependent on explicit reasoning; often it can simply be the linear extrapolation of how things are today."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h4","properties":{},"children":[{"type":"text","value":"Little Civilization"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"“Little Civ” is a mindset that springs from beliefs or assumptions such as 1) things will not last the way things are 2) Even if we started trying to “turn things around”, there might be a long period before we get things under control and return to our current levels of (uneven) prosperity 3) It is too late to truly turn things around. Again, this mindset does not have to be based on explicit reasoning, and does not need to be limited to climate issues. Arguably ‘preppers’ are the most well-known believers of the “Little Civ” mindset, without needing a shared civilization crisis they are all preparing for."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Again, there are things that ‘make sense’ based on the risk or ‘inevitability’ that things are going to fall apart: developing food/water/power self-sufficiency; relying more on local economies; making emergency action plans for crisis moments; focusing social bonds in your immediate community; building up stocks of emergency supplies; taking resources out of the global economy and investing locally. Examples specifically from a climate perspective include: building sea walls to protect bays against rising water levels; moving housing away from flood/fire/storm areas; and numerous adaptions of the generic “Little Civ” "}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"So, the courses of action that individuals, communities and organizations will consider taking are shaped by their own orientations (explicit or not) around “Big Civ” and “Little Civ”. Additionally when considering collective action, sensible actors should also identify and consider the orientations of other actors; what mindsets are others bringing into their decision-making? To be explicit, if a collective action makes sense in one orientation but not another, it is an uphill struggle to get folks that hold different orientations to invest in the collective action; There needs to be some alignment on orientation for that to even be considered."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"To reiterate, while I am talking about climate chaos and its impact on how folk take on “Big Civ” or “Little Civ” orientations, these orientations are separate from climate issues: One can orient as “Little Civ” because one believes, for example, that a zombie outbreak, alien invasion or nuclear war are just around the corner."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Before moving on to some nuances though, I want to state some broad assertions:"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"ul","properties":{},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Most of us (myself included) are currently anchoring our actions from a “Big Civ” orientation;"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"For that majority, considering “Little Civ” as an orientation can feel like facing death; the death of our world-orientation, our world-frame. Climate chaos is increasingly forcing folk to face the possibility that “Big Civ” will unravel."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"This felt sense of ‘facing death’ can drive us to denial, nihilism and fatalism, with two common varieties: we build elaborate rationalizations for how the scientific consensus is either a hoax, wrong or not as bad as it seems; or we acknowledge the consensus and then avoid reading about it or thinking about the future, often with background sense of gnawing dread."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"If “Little Civ” futures are possible, than this denial will stop us from preparing for them."}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h4","properties":{},"children":[{"type":"text","value":"A few nuances"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"“Little Civ” and “Big Civ” do not capture the whole range of big-picture orientations. They "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"are"}]},{"type":"text","value":" the main thrust of this piece but there are two other orientations that encompass a range of other behaviors and mindsets that I want to quickly address. These two other useful orientations are “Survival” and “Next Civilization”."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Acknowledging “Survival” as an orientation is acknowledging that there are many folk in the current system that are mentally or materially in a survival situation, where their behavior, thinking and actions are short-term, constrained and reactionary. Example populations in “Survival” orientation include: refugees, subsistence farmers in famine areas, folks impacted by natural disasters, some workers stripped of jobs via the globalized economy, some folks in highly oppressed identity groups, some of the folks in dire poverty in industrialized countries, and some ‘wage slaves’. These groups are less able to control or shape their fate. Note, each individual in these groups will face their own battle with slipping into “Survival” mode when their external conditions degrade; Some of them manage to maintain agency or a broader orientation. Globally, the “Survival” population exist as a challenge for societies today, one that we are largely failing."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"“Next Civilization” is a catch-all; for those orientations that are yearning for the next thing, beyond “Big Civ”. These orientations are united in seeing flaws in the current “Big Civilization” and seek to replace or evolve past it with a different, “better” paradigm. “Better” here is self-defined by the adherents of different forms of “Next Civ”, and can easily be in opposition to one another. Examples of “Next Civ” include decentralized crypto-currency adherents, meta-modernists, radical christian theologists, misogynist white supremacists, actual socialists (not just mislabeled social democrats) and a host of others. Many “Transformation by choice” climate outcomes would be deeply entwined with environmentally focused “Next Civ” ideas, and other “Next Civ” ideas would arguably be distractions from avoiding climate-related collapse."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h4","properties":{},"children":[{"type":"text","value":"How we arrive at an orientation"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"For most of us, what mix of “Big Civ”, “Little Civ” and other orientations one carries comes down to our processing of life-experiences, desires, risk, fear, community, and the narratives and tidbits of information we absorb through conversations and media (all medias: social, news, academic, entertainment, etc). While there will always be a subconscious processing aspect of our civilizational orientation, researching, gaining awareness and forming forecasts are ways we can be more explicit and precise about our orientation."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The winter break planning and research session certainly pushed my partner and I to face the higher possibility of “Little Civilization” futures. My implicit orientation previously would have been a mix of implicit “Big Civ” and more explicitly, various strands of “Next Civ”. I have been sober about the significant reluctance of governments, societies and “the market” to effectively address climate matters, despite legitimate successes such as the Montreal Protocol on CFCs. “Big Civilization” almost did address the climate challenge, "},{"type":"element","tagName":"a","properties":{"href":"https://www.nytimes.com/interactive/2018/08/01/magazine/climate-change-losing-earth.html"},"children":[{"type":"text","value":"in the 1980s"}]},{"type":"text","value":" but we fumbled and haven’t come as close since. What I did not seriously appreciate was the translation of numbers like “2-3 degrees of warming by 2100” into tangible impacts in our coming century, nor did I have an appreciation of how there were legitimate risks of even higher levels of warming by 2100. While I am still invested in “Big Civ” avoiding collapse, considering how I can prepare for “Little Civilization” scenarios is now part of my decision-making hedges regarding the future. I expect this to change over the coming years, for better or for worse, depending on how the planet and humanity collectively responds to this human-created climate challenge."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Of course, hedging one’s orientation comes at a cost"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"The challenge of the “Yes, No, Maybe” brain"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Narrative forcing of the brain "}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h2","properties":{},"children":[{"type":"text","value":"Decision"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Risk factors and leverage points"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"ul","properties":{},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Increasing proportion of the globe in “Survival” mode"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"What happens with deforestation in Brazil"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"What happens with big emitters/consumers, particularly the USA, China and Europe"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"What happens with arctic ice"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Methane"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Large Power conflict"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Negative emissions technology"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Geo-engineering; political and technological change"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Nuclear power; political change"}]},{"type":"text","value":"\n"}]}],"data":{"quirksMode":false}},"excerpt":"We all know a change is coming Over the winter break, my partner and I took the time to expansively map out the factors and possibilities of…","timeToRead":12,"frontmatter":{"title":"Big Civilization and Little Civilization","userDate":"15 May 2019","date":"2019-05-15T23:46:37.121Z","tags":["littleciv"],"image":null,"author":{"id":"Tom Watson","bio":"All things being even","avatar":{"children":[{"__typename":"ImageSharp","fixed":{"base64":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAUCAYAAACNiR0NAAAACXBIWXMAAA7EAAAOxAGVKw4bAAABkElEQVQ4y82Uy0sCURTG3ZQ9fGQ6T8eZyEwdrdHIMKWw/oFoE9UiIqJcFFJWaA8KiR5CGbQooVzUov7Lr7m3dCFSoxm0+Jh77uM353K+e0ysk0c7ZfpzINPPGT5M9tbvNzVadDk4KhJXx43mGiXRMEOR4+ERBPDM51ci4oXaHIndevxthkSci4fdymJtyYdSYQQxzYPFOS+ujkK41LW6MISgz42LfAjZdMAY0GZhsbsZwHs5imRMRiQk4elGQ6WkITEuQ9WBlTuNQg0DM+t+vNxHkEoo6OpkkNsK4jSrwtLD0h88FkdR2FebA77qwBkdaNaBUxMyUpMKus0MomEJZQI8aAFIIHY95r6K5bBxNMPfA11tAtIrdzCYjiuYTf7yyrWi6JD8dhBneyqsvS0WZWfDj7eHKLUJyahqG2Ij4sPnWw3nuZBxY6dXhum14mMylue9KJ6EcX0cpoYP+93U9IeZ4M/A6tOTRQFeRaRPsFoQIjIWWB6DsogBSWiuOTj7uNpcvcgakeHm0Jb29W879gejxi05rmT8GwAAAABJRU5ErkJggg==","width":400,"height":400,"src":"/static/47b900bd4475f6f27735e26ac02bb5d1/fba88/icon-logo.png","srcSet":"/static/47b900bd4475f6f27735e26ac02bb5d1/fba88/icon-logo.png 1x,\n/static/47b900bd4475f6f27735e26ac02bb5d1/1d604/icon-logo.png 1.5x"}}]}}}},"relatedPosts":{"totalCount":1,"edges":[{"node":{"id":"443ea2be-c2e4-57d4-90f4-e3c954088692","timeToRead":12,"excerpt":"We all know a change is coming Over the winter break, my partner and I took the time to expansively map out the factors and possibilities of…","frontmatter":{"title":"Big Civilization and Little Civilization"},"fields":{"slug":"/littleciv/littleciv/"}}}]}},"pageContext":{"slug":"/littleciv/littleciv/","prev":{"excerpt":"*  No teenager today is called Gerald. It is hard to pinpoint when we lost Gerald. He had been a member of our three year ‘rite of passage…","timeToRead":12,"frontmatter":{"title":"Losing Gerald*","tags":["rites of passage"],"date":"2019-02-26T15:11:55.000Z","image":{"childImageSharp":{"fluid":{"aspectRatio":1.5574136008918618,"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAANABQDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAIDBP/EABYBAQEBAAAAAAAAAAAAAAAAAAIAAf/aAAwDAQACEAMQAAABmuRzWMxi/8QAGxAAAQQDAAAAAAAAAAAAAAAAAgABAxEhIjL/2gAIAQEAAQUCkHdW4oye+o2PH//EABURAQEAAAAAAAAAAAAAAAAAAAAR/9oACAEDAQE/AUf/xAAXEQADAQAAAAAAAAAAAAAAAAAAAREh/9oACAECAQE/AVWaf//EABkQAAMBAQEAAAAAAAAAAAAAAAABIRECIv/aAAgBAQAGPwLNKoee2IWlp//EABwQAAICAgMAAAAAAAAAAAAAAAERAEExUSFxkf/aAAgBAQABPyEAzNQICxw9TCQ7ixYZcLPKzKj1P//aAAwDAQACAAMAAAAQNO//xAAXEQEAAwAAAAAAAAAAAAAAAAAAESFB/9oACAEDAQE/EK1F/8QAFxEBAAMAAAAAAAAAAAAAAAAAARARQf/aAAgBAgEBPxAUJsP/xAAdEAEAAgICAwAAAAAAAAAAAAABADERIUFxgZHR/9oACAEBAAE/EHh2myCL3GhXwFPUXpL2AvsxC6cpsWpq8SsuOAyuFoYqf//Z","sizes":"(max-width: 1397px) 100vw, 1397px","src":"/static/5c0eba56452a1712f8fac8316f155e21/6da92/boys.jpg","srcSet":"/static/5c0eba56452a1712f8fac8316f155e21/36363/boys.jpg 930w,\n/static/5c0eba56452a1712f8fac8316f155e21/6da92/boys.jpg 1397w"}}},"author":{"id":"Tom Watson","bio":"All things being even","avatar":{"children":[{"fixed":{"src":"/static/47b900bd4475f6f27735e26ac02bb5d1/fba88/icon-logo.png"}}]}}},"fields":{"layout":"post","slug":"/ritesofpassage/losing-gerald/"}},"next":null,"primaryTag":"littleciv"}}