{"data":{"logo":{"childImageSharp":{"fixed":{"base64":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAECAYAAACOXx+WAAAACXBIWXMAAA7EAAAOxAGVKw4bAAAA30lEQVQY022PuwrCMBhG00FRUIsKQi04iJfJC0IFxUXUQRB0EaFjW1ycfATfwIdwUJ9AbRYnSQcXX8hT7KBg4JD8+ZKTP+J2smK3s5U+7IUWyHVC+a4uvobyvYz4MwLppZT0mszaT4DQRri8HNvD531rKN+ZKukWOVjnQgka1I1AurWIHiSgyhk7+GQdaENTXE/WBuHweuysXo+djrCHoEvoIGvR4Yx6zOUc8wLCBwv8JM/eJKoHMId+2KGFcISwijCOsEKQQxh2mEWoq083dTDYqyDTIEltkpnRukxmvAF42IswAodQPwAAAABJRU5ErkJggg==","width":400,"height":89,"src":"/static/9efd9cc23dfa9a8aa5bd4f6570289133/51380/title-logo.png","srcSet":"/static/9efd9cc23dfa9a8aa5bd4f6570289133/51380/title-logo.png 1x,\n/static/9efd9cc23dfa9a8aa5bd4f6570289133/240c8/title-logo.png 1.5x,\n/static/9efd9cc23dfa9a8aa5bd4f6570289133/f5cf3/title-logo.png 2x"}}},"markdownRemark":{"html":"<p>I am going to dive into outlining a generic mental model for what organizations tend to do when they have geo-data acquisition needs. A model like this is useful for creating a common understanding for how organizations tend to deal with the challenges around acquiring geo-data.\n<sub><em>Epistemic status: very specific reflections on a niche domain I have spent a lot of time operating in. Planning on adding more about metrics at a later date</em><sub/></p>\n<h5>General model for geo-data acquisition</h5>\n<p>When seeking to describe a model for anything, a tension exists between simplifying the model down to the most essential aspects, and including nothing more. It is obviously important to detail what is in a model; less obviously, it is also critical to detail what is not included in a model or otherwise delegated to higher or lower scopes.</p>\n<p>Based on my observations of geo-data acquisition practices in the Anglo-American (“Five Eye”) intelligence community, in Terravion, an aerial imagery start up, and working for the Capture Systems team in HERE, the most essential elements for the general model for geo-data acquisition are:</p>\n<ul>\n<li>Requirements</li>\n<li>Acquisition</li>\n<li>Feedback</li>\n</ul>\n<p><a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/3bd34a59e1693bcead41a58486c9b4cb/274e8/data_acq_model.png\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n    <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 660px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 39.3939393939394%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAICAYAAAD5nd/tAAAACXBIWXMAAAsSAAALEgHS3X78AAABt0lEQVQoz02PzSsEcRjHZ0UtKW1eYvN2oMQFOztjZ5e94eTEgYuXkAPJ0f+gvCTlQBJ2Z1+whNmZHc3apMFBcqUkF3nJaZV4fMfOLlOfnvl9f7/n+3wfhsEX9TsqwQpYA6tgM+pn62MhrwV1CWcx6mteR92RRWe7LHLZ0BfAZuo9K4J2Jv3JIt+lH3nodF+gRESgm7iX0DggbTXaEnsuOjvwUGKvja41L6FxBibl2jYPXaCTiIuuVI+hz/+aSb4mTgm4FvXY8Pv58dinro4mL9QhUsPe2cONhn4t0vkG/etSm0zqSh8hqS/qb55Wgu5XPTYCfSJ5JnWT5GtcRvJeJrUy2xPfFeg4LFAs6KJLuRUJuUEMK1ZDHGk7hs7TueQ2E7K12OA7vusmNeQmYztoc/9WdrJY4xk8gQfwgQcdstiSg3qH8wvqPUiCcZAPbs33j/j/gMdUOh0MHYwc4PORqgIXDiXQkvs3jLMqIm8zhoLSjO535uIOSTk7KIBxltnAwtSZSYsBxaDITJEHLKZuBTZQAapBHahJ36eGsJlpRoPFMDebc8zmQlAGqoAdlJgDDaz/jCxpsx+lZyJCGXKsfAAAAABJRU5ErkJggg=='); background-size: cover; display: block;\"\n    ></span>\n    <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;\"\n        alt=\"geo-data acquisition model\"\n        title=\"\"\n        src=\"/static/3bd34a59e1693bcead41a58486c9b4cb/274e8/data_acq_model.png\"\n        srcset=\"/static/3bd34a59e1693bcead41a58486c9b4cb/fad6a/data_acq_model.png 293w,\n/static/3bd34a59e1693bcead41a58486c9b4cb/73f36/data_acq_model.png 585w,\n/static/3bd34a59e1693bcead41a58486c9b4cb/274e8/data_acq_model.png 660w\"\n        sizes=\"(max-width: 660px) 100vw, 660px\"\n      />\n  </span>\n  </a></p>\n<h4>Requirements</h4>\n<p><em>Requirements define what data/outcomes are needed.</em> The bulk of work around requirements stems from understanding the business problem that needs to be solved, expressing that as a singular requirement or a set of requirements, and framing those requirements in a way that can be easily passed to the acquisition part of the cycle. Typically this process also includes prioritization, basic cost analysis and a way to keep requestors up to date with the ongoing status of their requirements.</p>\n<h4>Acquisition</h4>\n<p>The two broadest categories of acquisition are 1) <em>getting the data from someone else</em> 2) <em>collecting it yourself.</em> While there are operational differences between requesting and receiving data from an external source, versus operating one’s own collection platforms, they share a common lifecycle: requirements need to be translated into acquisition planning, and data needs to be furnished in an agreed-on format and schema. The data provider in either case ought to go through processes including:</p>\n<ul>\n<li>Checking whether they already have data to satisfy a requirement</li>\n<li>If collection is required, breaking down requirements into a plan of specific tasks for their collection platform to execute on.</li>\n<li>Collection operations</li>\n<li>Collection validation</li>\n<li>Data delivery</li>\n</ul>\n<p>If data is externally sourced, these processes tend to be shielded from other actors in the rest of the cycle. If internally sourced, the implementation details of collection platform operation can leak out all through the overall cycle, if care is not taken to effectively encapsulate the collection platform.</p>\n<h4>Feedback</h4>\n<p><em>Feedback is the process of matching the acquired data up to its originating requirements, and confirming whether the acquired data fulfills those requirements.</em>  Often, the acquired data will undergo further processing and analysis after it has been received. Consequently, feedback may either be incremental or held up until all processing has been completed. The health or efficiency of the overall lifecycle is dependent on whether the feedback flowing back to the rest of the cycle is timely, concise and accurate.</p>\n<p><a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n    <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 32px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 100%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAUABQDASIAAhEBAxEB/8QAGAABAQEBAQAAAAAAAAAAAAAAAAIBAwT/xAAXAQADAQAAAAAAAAAAAAAAAAAAAgMB/9oADAMBAAIQAxAAAAHw3kxbgpVY0DmNP//EABsQAAMAAgMAAAAAAAAAAAAAAAECAwQSEzM0/9oACAEBAAEFAtVGORM0sAtW8izM7X7uRtTZyWYsf//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQMBAT8BH//EABoRAAEFAQAAAAAAAAAAAAAAAAABAhARMeH/2gAIAQIBAT8B6NwpI//EABsQAAMAAwEBAAAAAAAAAAAAAAABAhEhMUES/9oACAEBAAY/Apr53kiZlb6NIkjPpQp8Qm3wy+n/xAAcEAEAAwACAwAAAAAAAAAAAAABABEhEGExQaH/2gAIAQEAAT8haBPk7lVhqBFoPU+qEfZxA7GlmSyCqzIj3U//2gAMAwEAAgADAAAAEOsXw//EABgRAAIDAAAAAAAAAAAAAAAAAAABEBEx/9oACAEDAQE/EB6W4//EABkRAQEBAAMAAAAAAAAAAAAAAAEAIRFhcf/aAAgBAgEBPxA0Vdmj5dUHGF//xAAdEAEAAwACAwEAAAAAAAAAAAABABEhQVExgbGh/9oACAEBAAE/EMvqs8LcmDpVXomEIa4ocYTVfX6zSzFummz1P3HwgANIaYjcBBZKcfHUQDkNVP/Z'); background-size: cover; display: block;\"\n    ></span>\n    <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;\"\n        alt=\"break\"\n        title=\"\"\n        src=\"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg\"\n        srcset=\"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg 32w\"\n        sizes=\"(max-width: 32px) 100vw, 32px\"\n      />\n  </span>\n  </a></p>\n<h4>What is left out of this model?</h4>\n<p>Steps prior to defining requirements are left out. Figuring out what problem sets or market fit are important for an organization; this process is where requirements come from. However delving into that would be a distraction from the core cycle of the model. Similarly, steps after feedback beyond scope; how processing is done, how the data is served or archived, marketing to customers, etc. All important aspects to consider for an organization as a whole but distracting for our current focus.</p>\n<blockquote>\n<p>Readers who are familiar with data acquisition might be wondering about some key aspect of the acquisition cycle they are familiar with, and questioning why it is not included. What about ingestion or routing? Or task orchestration? Where is the campaign management? Data integrity/security/privacy? Or quality assurance?</p>\n</blockquote>\n<p>These tend to be implementation details of the wider cycle. Depending on the scale of data acquisition in an organization, it makes sense to call out more specific steps and sub-processes as they are required. In the same way that routing, fleet management and other collection operations are sub-components of the overall theme of acquisition, quality assurance, ingestion, data integrity measures, etc, are ultimately all forms of feedback. It is not uncommon for different organizations or groups to use different names (campaign management, scope management, collection orchestration) for the same function (a process to ensure requirements are turned into instructions for acquisition platforms). This cross-labelling risk applies even to this model. I have tried to establish the most generic labels for separating the major conceptual parts of the cycle, with requirements, acquisition, and feedback. Perhaps more “intuitive” terms exist.</p>\n<h4>What is the scale of the model?</h4>\n<p>The model is meant to broadly define the major de facto stages of data acquisition, whether undertaken by a small startup, multi-agency governmental community, global multi-national company or even an individual. As an individual, I might be interested in buying a rural property. In order to inform myself about the property’s potential, I might determine I want to assess the soil composition of the area and seasonal sun exposure on the property (hopefully information I can get from the local council/government). Additionally, I might even bring my drone on a visit, and get an overhead view of the spatial relationships across the property. All of this can be expressed in the frame of a generic data acquisition model: figuring out my requirements, acquiring the data from other sources or via my drone, and checking the data (perhaps in real-time on the drone’s live-video feed) against my requirements (the feedback phase).</p>\n<blockquote>\n<p>Does it make sense to apply a generic data acquisition model to my interest in a property? No. </p>\n</blockquote>\n<p>While the model might generally describe what steps I take in getting geo-data related to the property, it probably will not help me catch aspects I may have missed, or otherwise have failed to coordinate. The scale of my project is so small, it easily fits inside my head. Thus, while the model can be applied to smaller scales, it is most useful when applied to larger scales.</p>\n<p>As the scale of a data acquisition effort increases, so increases the value of a shared, clear operating picture, good instrumentation, and data driven decision making. These things are underpinned by a clear mental model for the data acquisition cycle.</p>\n<p>As an organization grows, its data acquisition cycle graduates from a simple process shared between a few people, to a process that involves more and more components, people and specialized responsibilities. An acquisition cycle that was small, simple and easy to understand when an organization was just getting off the ground, will likely evolve during the growth of the organization in messy and unclear ways. This organizational confusion shows up in a variety of ways, which will be addressed in the next section on common pitfalls in data acquisition.</p>\n<hr>\n<h5>Common challenges in the data acquisition cycle</h5>\n<p>Below is a non-exhaustive list of common challenges organizations encounter when scaling their data acquisition efforts.</p>\n<p><a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n    <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 32px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 100%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAUABQDASIAAhEBAxEB/8QAGAABAQEBAQAAAAAAAAAAAAAAAAIBAwT/xAAXAQADAQAAAAAAAAAAAAAAAAAAAgMB/9oADAMBAAIQAxAAAAHw3kxbgpVY0DmNP//EABsQAAMAAgMAAAAAAAAAAAAAAAECAwQSEzM0/9oACAEBAAEFAtVGORM0sAtW8izM7X7uRtTZyWYsf//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQMBAT8BH//EABoRAAEFAQAAAAAAAAAAAAAAAAABAhARMeH/2gAIAQIBAT8B6NwpI//EABsQAAMAAwEBAAAAAAAAAAAAAAABAhEhMUES/9oACAEBAAY/Apr53kiZlb6NIkjPpQp8Qm3wy+n/xAAcEAEAAwACAwAAAAAAAAAAAAABABEhEGExQaH/2gAIAQEAAT8haBPk7lVhqBFoPU+qEfZxA7GlmSyCqzIj3U//2gAMAwEAAgADAAAAEOsXw//EABgRAAIDAAAAAAAAAAAAAAAAAAABEBEx/9oACAEDAQE/EB6W4//EABkRAQEBAAMAAAAAAAAAAAAAAAEAIRFhcf/aAAgBAgEBPxA0Vdmj5dUHGF//xAAdEAEAAwACAwEAAAAAAAAAAAABABEhQVExgbGh/9oACAEBAAE/EMvqs8LcmDpVXomEIa4ocYTVfX6zSzFummz1P3HwgANIaYjcBBZKcfHUQDkNVP/Z'); background-size: cover; display: block;\"\n    ></span>\n    <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;\"\n        alt=\"break\"\n        title=\"\"\n        src=\"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg\"\n        srcset=\"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg 32w\"\n        sizes=\"(max-width: 32px) 100vw, 32px\"\n      />\n  </span>\n  </a></p>\n<h4>Requirement-related challenges</h4>\n<h6>Skipping requirements</h6>\n<p>When there is no requirement process or individuals in an organization just skip them, the risk is that resources will be misallocated when acquiring data. This risk only increases as the number of acquisition platforms and data requestors increases.</p>\n<h6>Incomplete existing data check</h6>\n<p>When requirements come in, it is wise to check against existing data holdings. If a requirement is already serviced by existing data, it should be satisfied with that. Not addressing this challenge results in the organization using resources to require unnecessary data.</p>\n<h6>Incomplete prioritization system</h6>\n<p>If requirements are not prioritized, and/or there is not a clear system by which prioritization occurs, the overall cycle will either misallocate resources to lesser requirements or be delayed as manual efforts are required to seek priorities.</p>\n<h6>Incomplete/confusing requirements interface</h6>\n<p>If there are multiple ways to submit requirements, unclear processes or poorly defined responsibilities for handling requirements, confusion will rain. The data acquisition cycle will miss requirements, misallocate resources, and fail to consistently serve the goals of the wider organization.</p>\n<hr>\n<h4>Challenges in the space between requirements and acquisition</h4>\n<h6>Requirements that do not translate to clear acquisition tasks</h6>\n<p>There needs to be coherent ways to translate requirements into tasks for an acquisition platform. The differences in how acquisition platforms operate means that this requires careful thinking and design for any requirement coordinating system. Failure to achieve this means that acquisition platforms will be mis-tasked (thus wasting resources and missing opportunities).</p>\n<h6>Lack of knowledge about acquisition platform particulars</h6>\n<p>Every data acquisition system will attempt to abstract the differences between acquisition platforms, and even the differences between individual instances of those platforms. If the requirements system does not allow the articulation of requirements that use the full capabilities of an acquisition platform, the organization will end up missing out on those capabilities.</p>\n<hr>\n<h4>Acquisition-related challenges</h4>\n<h6>Incomplete orchestration</h6>\n<p>Orchestration is the process whereby collections of requirements are compared to see which ones overlap or are complimentary, allowing for a more efficient set of tasks to be provided to an acquisition platform. Naïve orchestration will create tasks that are nearly identical, duplicating effort and wasting resources.</p>\n<h6>Collection anomalies</h6>\n<p>Every acquisition platform will have anomalies and edge-cases that will make its output less useful. Whether this is atmospheric conditions for clouds, road closures for road-based collectors or software glitches, these errors and blips are a given. Making sure these are tracked and mitigated is a common challenge in data acquisition. </p>\n<hr>\n<h4>Feedback-related challenges</h4>\n<h6>Skip feedback</h6>\n<p>Skipping a systemic approach to feedback works fine for small scale operations; verbal or ad-hoc feedback about data problems suffices. This does not work as an organization scales. Skipping feedback ultimately just pushes this work on to your customers/end-users, except by that stage there may be no effective way to trace problems back to their origin in the data acquisition cycle.</p>\n<h6>Slow feedback</h6>\n<p>The longer requirements are left open or acquisition platforms are left without completion feedback, the longer they are left in an unclear state. This can impact orchestration (for example: do you include a requirement in orchestration today, when it was meant to be collected last week but you don’t know if that collection worked?), and otherwise lowers agility.</p>\n<h6>Incomplete feedback</h6>\n<p>Getting effective feedback on what acquisition tasks have been completed but not which requirements have been satisfied, or vice-versa, are examples of incomplete feedback. Failing to address this will undermine different decision points throughout the cycle.</p>\n<h6>Deidentified feedback</h6>\n<p>If the data identities are not meaningfully tracked through the data acquisition cycle, feedback becomes a challenging forensic process. If someone comes to you and states “these pieces of data are corrupted” and there are not ways to easily identify which task they were acquired by, which requirements they relate to or which acquisition platform they stem from, debugging what is going wrong becomes a time-consuming feat.</p>\n<h6>Incremental feedback</h6>\n<p>Processing acquired data can require several stages and take time. Some parts of the data might be finished before others. This can make it difficult to define when an acquisition task or a requirement is “done”. If this detail is not ironed out, it can result in confusing statistics on the progress of data acquisition, leading to chaotic decision making.</p>\n<hr>\n<h4>Wider challenges</h4>\n<h6>Lack of shared understanding of an organization’s data acquisition cycle</h6>\n<p>If individuals working within the data acquisition cycle do not share a common understanding of the cycle, trouble-shooting issues and improving the cycle becomes chaotic</p>\n<h6>Incomplete privacy controls</h6>\n<p>Acquired data can easily include ways to identify individuals and risk breaching their privacy. For both moral and legal reasons, having a system wide awareness of privacy matters is the only way to mitigate the risk of privacy breaches.</p>\n<h6>Incomplete security controls</h6>\n<p>Similarly, system wide security awareness ought to be calibrated to the level of risk. Sufficiently large scale technology companies should consider their networks compromised and secure internally on that assumption. </p>\n<h6>Misalignment between requirement, acquisition and feedback</h6>\n<p>This challenge tends to show up when data acquisition cycles undergo great change in their requirements or access to acquisition platforms. Understanding of new demands or new/lost acquisition platforms has not spread sufficiently across people and systems involved in the whole cycle. </p>\n<h6>Process duplication</h6>\n<p>Process duplication is when there are multiple parts an organization repeating the same functionality in the data acquisition cycle, or the organization has completely separate data acquisition cycles co-existing. Acquisition platforms will proliferate, if they have justifiably different capabilities and use-cases. It’s harder to justify having multiple requirement-management or feedback systems; proliferating these tends to cause chaos, as requestors have to petition multiple</p>\n<h6>Complex coupling</h6>\n<p>When different parts of the acquisition cycle are coupling in complex ways, making changes to the different sub-sections or adding new sub-sections to the overall cycle becomes awkward. Changes in one system can cause problems downstream. A common time this becomes apparent is when the acquisition cycle revolves around a particular platform, and then a new platform is introduced.</p>\n<h6>Unclear reference geometry</h6>\n<p>Geo-data is unsurprising heavily dependent to having geometric representations. One frustrating challenge that can plague a data acquisition cycle is having reference geometries that do not suit all parts of the cycle, or having unclear ways of translating between the different reference geometry in different parts of the cycle. To provide a task to an acquisition platform, you typically need very well defined geometric instructions: collect all data on these specific roads, or point the sensor at this point on the earth when the platform is at this geometry in space. It is important that these discrete geometries match the intent of geometries defined in requirements, which tend to be coarser. </p>","htmlAst":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I am going to dive into outlining a generic mental model for what organizations tend to do when they have geo-data acquisition needs. A model like this is useful for creating a common understanding for how organizations tend to deal with the challenges around acquiring geo-data.\n"},{"type":"element","tagName":"sub","properties":{},"children":[{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"Epistemic status: very specific reflections on a niche domain I have spent a lot of time operating in. Planning on adding more about metrics at a later date"}]},{"type":"element","tagName":"sub","properties":{},"children":[]}]}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h5","properties":{},"children":[{"type":"text","value":"General model for geo-data acquisition"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"When seeking to describe a model for anything, a tension exists between simplifying the model down to the most essential aspects, and including nothing more. It is obviously important to detail what is in a model; less obviously, it is also critical to detail what is not included in a model or otherwise delegated to higher or lower scopes."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Based on my observations of geo-data acquisition practices in the Anglo-American (“Five Eye”) intelligence community, in Terravion, an aerial imagery start up, and working for the Capture Systems team in HERE, the most essential elements for the general model for geo-data acquisition are:"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"ul","properties":{},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Requirements"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Acquisition"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Feedback"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"a","properties":{"className":["gatsby-resp-image-link"],"href":"/static/3bd34a59e1693bcead41a58486c9b4cb/274e8/data_acq_model.png","style":"display: block","target":"_blank","rel":["noopener"]},"children":[{"type":"text","value":"\n    "},{"type":"element","tagName":"span","properties":{"className":["gatsby-resp-image-wrapper"],"style":"position: relative; display: block;  max-width: 660px; margin-left: auto; margin-right: auto;"},"children":[{"type":"text","value":"\n    "},{"type":"element","tagName":"span","properties":{"className":["gatsby-resp-image-background-image"],"style":"padding-bottom: 39.3939393939394%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAICAYAAAD5nd/tAAAACXBIWXMAAAsSAAALEgHS3X78AAABt0lEQVQoz02PzSsEcRjHZ0UtKW1eYvN2oMQFOztjZ5e94eTEgYuXkAPJ0f+gvCTlQBJ2Z1+whNmZHc3apMFBcqUkF3nJaZV4fMfOLlOfnvl9f7/n+3wfhsEX9TsqwQpYA6tgM+pn62MhrwV1CWcx6mteR92RRWe7LHLZ0BfAZuo9K4J2Jv3JIt+lH3nodF+gRESgm7iX0DggbTXaEnsuOjvwUGKvja41L6FxBibl2jYPXaCTiIuuVI+hz/+aSb4mTgm4FvXY8Pv58dinro4mL9QhUsPe2cONhn4t0vkG/etSm0zqSh8hqS/qb55Wgu5XPTYCfSJ5JnWT5GtcRvJeJrUy2xPfFeg4LFAs6KJLuRUJuUEMK1ZDHGk7hs7TueQ2E7K12OA7vusmNeQmYztoc/9WdrJY4xk8gQfwgQcdstiSg3qH8wvqPUiCcZAPbs33j/j/gMdUOh0MHYwc4PORqgIXDiXQkvs3jLMqIm8zhoLSjO535uIOSTk7KIBxltnAwtSZSYsBxaDITJEHLKZuBTZQAapBHahJ36eGsJlpRoPFMDebc8zmQlAGqoAdlJgDDaz/jCxpsx+lZyJCGXKsfAAAAABJRU5ErkJggg=='); background-size: cover; display: block;"},"children":[]},{"type":"text","value":"\n    "},{"type":"element","tagName":"img","properties":{"className":["gatsby-resp-image-image"],"style":"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;","alt":"geo-data acquisition model","title":"","src":"/static/3bd34a59e1693bcead41a58486c9b4cb/274e8/data_acq_model.png","srcSet":["/static/3bd34a59e1693bcead41a58486c9b4cb/fad6a/data_acq_model.png 293w","/static/3bd34a59e1693bcead41a58486c9b4cb/73f36/data_acq_model.png 585w","/static/3bd34a59e1693bcead41a58486c9b4cb/274e8/data_acq_model.png 660w"],"sizes":["(max-width:","660px)","100vw,","660px"]},"children":[]},{"type":"text","value":"\n  "}]},{"type":"text","value":"\n  "}]}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h4","properties":{},"children":[{"type":"text","value":"Requirements"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"Requirements define what data/outcomes are needed."}]},{"type":"text","value":" The bulk of work around requirements stems from understanding the business problem that needs to be solved, expressing that as a singular requirement or a set of requirements, and framing those requirements in a way that can be easily passed to the acquisition part of the cycle. Typically this process also includes prioritization, basic cost analysis and a way to keep requestors up to date with the ongoing status of their requirements."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h4","properties":{},"children":[{"type":"text","value":"Acquisition"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The two broadest categories of acquisition are 1) "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"getting the data from someone else"}]},{"type":"text","value":" 2) "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"collecting it yourself."}]},{"type":"text","value":" While there are operational differences between requesting and receiving data from an external source, versus operating one’s own collection platforms, they share a common lifecycle: requirements need to be translated into acquisition planning, and data needs to be furnished in an agreed-on format and schema. The data provider in either case ought to go through processes including:"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"ul","properties":{},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Checking whether they already have data to satisfy a requirement"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"If collection is required, breaking down requirements into a plan of specific tasks for their collection platform to execute on."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Collection operations"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Collection validation"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"li","properties":{},"children":[{"type":"text","value":"Data delivery"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"If data is externally sourced, these processes tend to be shielded from other actors in the rest of the cycle. If internally sourced, the implementation details of collection platform operation can leak out all through the overall cycle, if care is not taken to effectively encapsulate the collection platform."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h4","properties":{},"children":[{"type":"text","value":"Feedback"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"Feedback is the process of matching the acquired data up to its originating requirements, and confirming whether the acquired data fulfills those requirements."}]},{"type":"text","value":"  Often, the acquired data will undergo further processing and analysis after it has been received. Consequently, feedback may either be incremental or held up until all processing has been completed. The health or efficiency of the overall lifecycle is dependent on whether the feedback flowing back to the rest of the cycle is timely, concise and accurate."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"a","properties":{"className":["gatsby-resp-image-link"],"href":"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg","style":"display: block","target":"_blank","rel":["noopener"]},"children":[{"type":"text","value":"\n    "},{"type":"element","tagName":"span","properties":{"className":["gatsby-resp-image-wrapper"],"style":"position: relative; display: block;  max-width: 32px; margin-left: auto; margin-right: auto;"},"children":[{"type":"text","value":"\n    "},{"type":"element","tagName":"span","properties":{"className":["gatsby-resp-image-background-image"],"style":"padding-bottom: 100%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAUABQDASIAAhEBAxEB/8QAGAABAQEBAQAAAAAAAAAAAAAAAAIBAwT/xAAXAQADAQAAAAAAAAAAAAAAAAAAAgMB/9oADAMBAAIQAxAAAAHw3kxbgpVY0DmNP//EABsQAAMAAgMAAAAAAAAAAAAAAAECAwQSEzM0/9oACAEBAAEFAtVGORM0sAtW8izM7X7uRtTZyWYsf//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQMBAT8BH//EABoRAAEFAQAAAAAAAAAAAAAAAAABAhARMeH/2gAIAQIBAT8B6NwpI//EABsQAAMAAwEBAAAAAAAAAAAAAAABAhEhMUES/9oACAEBAAY/Apr53kiZlb6NIkjPpQp8Qm3wy+n/xAAcEAEAAwACAwAAAAAAAAAAAAABABEhEGExQaH/2gAIAQEAAT8haBPk7lVhqBFoPU+qEfZxA7GlmSyCqzIj3U//2gAMAwEAAgADAAAAEOsXw//EABgRAAIDAAAAAAAAAAAAAAAAAAABEBEx/9oACAEDAQE/EB6W4//EABkRAQEBAAMAAAAAAAAAAAAAAAEAIRFhcf/aAAgBAgEBPxA0Vdmj5dUHGF//xAAdEAEAAwACAwEAAAAAAAAAAAABABEhQVExgbGh/9oACAEBAAE/EMvqs8LcmDpVXomEIa4ocYTVfX6zSzFummz1P3HwgANIaYjcBBZKcfHUQDkNVP/Z'); background-size: cover; display: block;"},"children":[]},{"type":"text","value":"\n    "},{"type":"element","tagName":"img","properties":{"className":["gatsby-resp-image-image"],"style":"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;","alt":"break","title":"","src":"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg","srcSet":["/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg 32w"],"sizes":["(max-width:","32px)","100vw,","32px"]},"children":[]},{"type":"text","value":"\n  "}]},{"type":"text","value":"\n  "}]}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h4","properties":{},"children":[{"type":"text","value":"What is left out of this model?"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Steps prior to defining requirements are left out. Figuring out what problem sets or market fit are important for an organization; this process is where requirements come from. However delving into that would be a distraction from the core cycle of the model. Similarly, steps after feedback beyond scope; how processing is done, how the data is served or archived, marketing to customers, etc. All important aspects to consider for an organization as a whole but distracting for our current focus."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Readers who are familiar with data acquisition might be wondering about some key aspect of the acquisition cycle they are familiar with, and questioning why it is not included. What about ingestion or routing? Or task orchestration? Where is the campaign management? Data integrity/security/privacy? Or quality assurance?"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"These tend to be implementation details of the wider cycle. Depending on the scale of data acquisition in an organization, it makes sense to call out more specific steps and sub-processes as they are required. In the same way that routing, fleet management and other collection operations are sub-components of the overall theme of acquisition, quality assurance, ingestion, data integrity measures, etc, are ultimately all forms of feedback. It is not uncommon for different organizations or groups to use different names (campaign management, scope management, collection orchestration) for the same function (a process to ensure requirements are turned into instructions for acquisition platforms). This cross-labelling risk applies even to this model. I have tried to establish the most generic labels for separating the major conceptual parts of the cycle, with requirements, acquisition, and feedback. Perhaps more “intuitive” terms exist."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h4","properties":{},"children":[{"type":"text","value":"What is the scale of the model?"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The model is meant to broadly define the major de facto stages of data acquisition, whether undertaken by a small startup, multi-agency governmental community, global multi-national company or even an individual. As an individual, I might be interested in buying a rural property. In order to inform myself about the property’s potential, I might determine I want to assess the soil composition of the area and seasonal sun exposure on the property (hopefully information I can get from the local council/government). Additionally, I might even bring my drone on a visit, and get an overhead view of the spatial relationships across the property. All of this can be expressed in the frame of a generic data acquisition model: figuring out my requirements, acquiring the data from other sources or via my drone, and checking the data (perhaps in real-time on the drone’s live-video feed) against my requirements (the feedback phase)."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Does it make sense to apply a generic data acquisition model to my interest in a property? No. "}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"While the model might generally describe what steps I take in getting geo-data related to the property, it probably will not help me catch aspects I may have missed, or otherwise have failed to coordinate. The scale of my project is so small, it easily fits inside my head. Thus, while the model can be applied to smaller scales, it is most useful when applied to larger scales."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"As the scale of a data acquisition effort increases, so increases the value of a shared, clear operating picture, good instrumentation, and data driven decision making. These things are underpinned by a clear mental model for the data acquisition cycle."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"As an organization grows, its data acquisition cycle graduates from a simple process shared between a few people, to a process that involves more and more components, people and specialized responsibilities. An acquisition cycle that was small, simple and easy to understand when an organization was just getting off the ground, will likely evolve during the growth of the organization in messy and unclear ways. This organizational confusion shows up in a variety of ways, which will be addressed in the next section on common pitfalls in data acquisition."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"hr","properties":{},"children":[]},{"type":"text","value":"\n"},{"type":"element","tagName":"h5","properties":{},"children":[{"type":"text","value":"Common challenges in the data acquisition cycle"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Below is a non-exhaustive list of common challenges organizations encounter when scaling their data acquisition efforts."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"a","properties":{"className":["gatsby-resp-image-link"],"href":"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg","style":"display: block","target":"_blank","rel":["noopener"]},"children":[{"type":"text","value":"\n    "},{"type":"element","tagName":"span","properties":{"className":["gatsby-resp-image-wrapper"],"style":"position: relative; display: block;  max-width: 32px; margin-left: auto; margin-right: auto;"},"children":[{"type":"text","value":"\n    "},{"type":"element","tagName":"span","properties":{"className":["gatsby-resp-image-background-image"],"style":"padding-bottom: 100%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAUABQDASIAAhEBAxEB/8QAGAABAQEBAQAAAAAAAAAAAAAAAAIBAwT/xAAXAQADAQAAAAAAAAAAAAAAAAAAAgMB/9oADAMBAAIQAxAAAAHw3kxbgpVY0DmNP//EABsQAAMAAgMAAAAAAAAAAAAAAAECAwQSEzM0/9oACAEBAAEFAtVGORM0sAtW8izM7X7uRtTZyWYsf//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQMBAT8BH//EABoRAAEFAQAAAAAAAAAAAAAAAAABAhARMeH/2gAIAQIBAT8B6NwpI//EABsQAAMAAwEBAAAAAAAAAAAAAAABAhEhMUES/9oACAEBAAY/Apr53kiZlb6NIkjPpQp8Qm3wy+n/xAAcEAEAAwACAwAAAAAAAAAAAAABABEhEGExQaH/2gAIAQEAAT8haBPk7lVhqBFoPU+qEfZxA7GlmSyCqzIj3U//2gAMAwEAAgADAAAAEOsXw//EABgRAAIDAAAAAAAAAAAAAAAAAAABEBEx/9oACAEDAQE/EB6W4//EABkRAQEBAAMAAAAAAAAAAAAAAAEAIRFhcf/aAAgBAgEBPxA0Vdmj5dUHGF//xAAdEAEAAwACAwEAAAAAAAAAAAABABEhQVExgbGh/9oACAEBAAE/EMvqs8LcmDpVXomEIa4ocYTVfX6zSzFummz1P3HwgANIaYjcBBZKcfHUQDkNVP/Z'); background-size: cover; display: block;"},"children":[]},{"type":"text","value":"\n    "},{"type":"element","tagName":"img","properties":{"className":["gatsby-resp-image-image"],"style":"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;","alt":"break","title":"","src":"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg","srcSet":["/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg 32w"],"sizes":["(max-width:","32px)","100vw,","32px"]},"children":[]},{"type":"text","value":"\n  "}]},{"type":"text","value":"\n  "}]}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h4","properties":{},"children":[{"type":"text","value":"Requirement-related challenges"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Skipping requirements"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"When there is no requirement process or individuals in an organization just skip them, the risk is that resources will be misallocated when acquiring data. This risk only increases as the number of acquisition platforms and data requestors increases."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Incomplete existing data check"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"When requirements come in, it is wise to check against existing data holdings. If a requirement is already serviced by existing data, it should be satisfied with that. Not addressing this challenge results in the organization using resources to require unnecessary data."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Incomplete prioritization system"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"If requirements are not prioritized, and/or there is not a clear system by which prioritization occurs, the overall cycle will either misallocate resources to lesser requirements or be delayed as manual efforts are required to seek priorities."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Incomplete/confusing requirements interface"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"If there are multiple ways to submit requirements, unclear processes or poorly defined responsibilities for handling requirements, confusion will rain. The data acquisition cycle will miss requirements, misallocate resources, and fail to consistently serve the goals of the wider organization."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"hr","properties":{},"children":[]},{"type":"text","value":"\n"},{"type":"element","tagName":"h4","properties":{},"children":[{"type":"text","value":"Challenges in the space between requirements and acquisition"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Requirements that do not translate to clear acquisition tasks"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"There needs to be coherent ways to translate requirements into tasks for an acquisition platform. The differences in how acquisition platforms operate means that this requires careful thinking and design for any requirement coordinating system. Failure to achieve this means that acquisition platforms will be mis-tasked (thus wasting resources and missing opportunities)."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Lack of knowledge about acquisition platform particulars"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Every data acquisition system will attempt to abstract the differences between acquisition platforms, and even the differences between individual instances of those platforms. If the requirements system does not allow the articulation of requirements that use the full capabilities of an acquisition platform, the organization will end up missing out on those capabilities."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"hr","properties":{},"children":[]},{"type":"text","value":"\n"},{"type":"element","tagName":"h4","properties":{},"children":[{"type":"text","value":"Acquisition-related challenges"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Incomplete orchestration"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Orchestration is the process whereby collections of requirements are compared to see which ones overlap or are complimentary, allowing for a more efficient set of tasks to be provided to an acquisition platform. Naïve orchestration will create tasks that are nearly identical, duplicating effort and wasting resources."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Collection anomalies"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Every acquisition platform will have anomalies and edge-cases that will make its output less useful. Whether this is atmospheric conditions for clouds, road closures for road-based collectors or software glitches, these errors and blips are a given. Making sure these are tracked and mitigated is a common challenge in data acquisition. "}]},{"type":"text","value":"\n"},{"type":"element","tagName":"hr","properties":{},"children":[]},{"type":"text","value":"\n"},{"type":"element","tagName":"h4","properties":{},"children":[{"type":"text","value":"Feedback-related challenges"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Skip feedback"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Skipping a systemic approach to feedback works fine for small scale operations; verbal or ad-hoc feedback about data problems suffices. This does not work as an organization scales. Skipping feedback ultimately just pushes this work on to your customers/end-users, except by that stage there may be no effective way to trace problems back to their origin in the data acquisition cycle."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Slow feedback"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The longer requirements are left open or acquisition platforms are left without completion feedback, the longer they are left in an unclear state. This can impact orchestration (for example: do you include a requirement in orchestration today, when it was meant to be collected last week but you don’t know if that collection worked?), and otherwise lowers agility."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Incomplete feedback"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Getting effective feedback on what acquisition tasks have been completed but not which requirements have been satisfied, or vice-versa, are examples of incomplete feedback. Failing to address this will undermine different decision points throughout the cycle."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Deidentified feedback"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"If the data identities are not meaningfully tracked through the data acquisition cycle, feedback becomes a challenging forensic process. If someone comes to you and states “these pieces of data are corrupted” and there are not ways to easily identify which task they were acquired by, which requirements they relate to or which acquisition platform they stem from, debugging what is going wrong becomes a time-consuming feat."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Incremental feedback"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Processing acquired data can require several stages and take time. Some parts of the data might be finished before others. This can make it difficult to define when an acquisition task or a requirement is “done”. If this detail is not ironed out, it can result in confusing statistics on the progress of data acquisition, leading to chaotic decision making."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"hr","properties":{},"children":[]},{"type":"text","value":"\n"},{"type":"element","tagName":"h4","properties":{},"children":[{"type":"text","value":"Wider challenges"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Lack of shared understanding of an organization’s data acquisition cycle"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"If individuals working within the data acquisition cycle do not share a common understanding of the cycle, trouble-shooting issues and improving the cycle becomes chaotic"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Incomplete privacy controls"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Acquired data can easily include ways to identify individuals and risk breaching their privacy. For both moral and legal reasons, having a system wide awareness of privacy matters is the only way to mitigate the risk of privacy breaches."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Incomplete security controls"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Similarly, system wide security awareness ought to be calibrated to the level of risk. Sufficiently large scale technology companies should consider their networks compromised and secure internally on that assumption. "}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Misalignment between requirement, acquisition and feedback"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"This challenge tends to show up when data acquisition cycles undergo great change in their requirements or access to acquisition platforms. Understanding of new demands or new/lost acquisition platforms has not spread sufficiently across people and systems involved in the whole cycle. "}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Process duplication"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Process duplication is when there are multiple parts an organization repeating the same functionality in the data acquisition cycle, or the organization has completely separate data acquisition cycles co-existing. Acquisition platforms will proliferate, if they have justifiably different capabilities and use-cases. It’s harder to justify having multiple requirement-management or feedback systems; proliferating these tends to cause chaos, as requestors have to petition multiple"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Complex coupling"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"When different parts of the acquisition cycle are coupling in complex ways, making changes to the different sub-sections or adding new sub-sections to the overall cycle becomes awkward. Changes in one system can cause problems downstream. A common time this becomes apparent is when the acquisition cycle revolves around a particular platform, and then a new platform is introduced."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h6","properties":{},"children":[{"type":"text","value":"Unclear reference geometry"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Geo-data is unsurprising heavily dependent to having geometric representations. One frustrating challenge that can plague a data acquisition cycle is having reference geometries that do not suit all parts of the cycle, or having unclear ways of translating between the different reference geometry in different parts of the cycle. To provide a task to an acquisition platform, you typically need very well defined geometric instructions: collect all data on these specific roads, or point the sensor at this point on the earth when the platform is at this geometry in space. It is important that these discrete geometries match the intent of geometries defined in requirements, which tend to be coarser. "}]}],"data":{"quirksMode":false}},"excerpt":"I am going to dive into outlining a generic mental model for what organizations tend to do when they have geo-data acquisition needs. A…","timeToRead":10,"frontmatter":{"title":"A generic mental model for geo-data acquisition","userDate":"16 February 2019","date":"2019-02-16T23:46:37.121Z","tags":[],"image":{"childImageSharp":{"fluid":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAALABQDASIAAhEBAxEB/8QAGAAAAwEBAAAAAAAAAAAAAAAAAAQFAwb/xAAWAQEBAQAAAAAAAAAAAAAAAAAAAgP/2gAMAwEAAhADEAAAAWGuY0zu6QA//8QAGRAAAgMBAAAAAAAAAAAAAAAAAQMABBAR/9oACAEBAAEFAhaVA9fDZXBv/8QAFhEBAQEAAAAAAAAAAAAAAAAAAQAR/9oACAEDAQE/AQLC/8QAFREBAQAAAAAAAAAAAAAAAAAAARD/2gAIAQIBAT8BZ//EABcQAAMBAAAAAAAAAAAAAAAAAAAgQTH/2gAIAQEABj8CppU//8QAHBAAAgAHAAAAAAAAAAAAAAAAAAERMUFRgZGx/9oACAEBAAE/IXLMDkXAi56ClBn/2gAMAwEAAgADAAAAEBs//8QAFxEAAwEAAAAAAAAAAAAAAAAAAAEhYf/aAAgBAwEBPxBpUyP/xAAYEQADAQEAAAAAAAAAAAAAAAAAARFBUf/aAAgBAgEBPxCsZH0//8QAGxABAAICAwAAAAAAAAAAAAAAAQARIXExYdH/2gAIAQEAAT8QrLN49lP1O4el2pDmswUILTBmf//Z","aspectRatio":1.7814432989690723,"src":"/static/e8b2ed543f06ae7589919c2392ed2d3b/ab9cf/sun.jpg","srcSet":"/static/e8b2ed543f06ae7589919c2392ed2d3b/ab9cf/sun.jpg 864w","sizes":"(max-width: 864px) 100vw, 864px"}}},"author":{"id":"Tom Watson","bio":"All things being even","avatar":{"children":[{"__typename":"ImageSharp","fixed":{"base64":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAUCAYAAACNiR0NAAAACXBIWXMAAA7EAAAOxAGVKw4bAAABkElEQVQ4y82Uy0sCURTG3ZQ9fGQ6T8eZyEwdrdHIMKWw/oFoE9UiIqJcFFJWaA8KiR5CGbQooVzUov7Lr7m3dCFSoxm0+Jh77uM353K+e0ysk0c7ZfpzINPPGT5M9tbvNzVadDk4KhJXx43mGiXRMEOR4+ERBPDM51ci4oXaHIndevxthkSci4fdymJtyYdSYQQxzYPFOS+ujkK41LW6MISgz42LfAjZdMAY0GZhsbsZwHs5imRMRiQk4elGQ6WkITEuQ9WBlTuNQg0DM+t+vNxHkEoo6OpkkNsK4jSrwtLD0h88FkdR2FebA77qwBkdaNaBUxMyUpMKus0MomEJZQI8aAFIIHY95r6K5bBxNMPfA11tAtIrdzCYjiuYTf7yyrWi6JD8dhBneyqsvS0WZWfDj7eHKLUJyahqG2Ij4sPnWw3nuZBxY6dXhum14mMylue9KJ6EcX0cpoYP+93U9IeZ4M/A6tOTRQFeRaRPsFoQIjIWWB6DsogBSWiuOTj7uNpcvcgakeHm0Jb29W879gejxi05rmT8GwAAAABJRU5ErkJggg==","width":400,"height":400,"src":"/static/47b900bd4475f6f27735e26ac02bb5d1/fba88/icon-logo.png","srcSet":"/static/47b900bd4475f6f27735e26ac02bb5d1/fba88/icon-logo.png 1x,\n/static/47b900bd4475f6f27735e26ac02bb5d1/1d604/icon-logo.png 1.5x"}}]}}}},"relatedPosts":null},"pageContext":{"slug":"/data-acquisition/","prev":{"excerpt":"Why: this? A confluence of factors have driven me to set up this site: wanting to clarify my thinking by writing; framing my thoughts in…","timeToRead":2,"frontmatter":{"title":"Building this site","tags":["why"],"date":"2019-01-05T23:46:37.121Z","excerpt":"A confluence of factors have driven me to set up this site: wanting to clarify my thinking by writing; framing my thoughts in prose and paragraph; wanting to have a place to publish these writings...","image":{"childImageSharp":{"fluid":{"aspectRatio":1.9479843953185956,"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAKABQDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABAAC/8QAFQEBAQAAAAAAAAAAAAAAAAAAAQL/2gAMAwEAAhADEAAAAcmFAmNVP//EABoQAAICAwAAAAAAAAAAAAAAAAABAgMREiD/2gAIAQEAAQUCzQOUDZcf/8QAFhEBAQEAAAAAAAAAAAAAAAAAAAES/9oACAEDAQE/Aay//8QAFhEBAQEAAAAAAAAAAAAAAAAAAAER/9oACAECAQE/AY1//8QAFhAAAwAAAAAAAAAAAAAAAAAAACAh/9oACAEBAAY/AiL/AP/EABwQAAIBBQEAAAAAAAAAAAAAAAERACAhQWGB8P/aAAgBAQABPyELw9uOWDgnhUf/2gAMAwEAAgADAAAAEOsP/8QAFxEBAQEBAAAAAAAAAAAAAAAAAQARQf/aAAgBAwEBPxADyxf/xAAXEQADAQAAAAAAAAAAAAAAAAABEBFB/9oACAECAQE/EKGp/8QAGhABAAIDAQAAAAAAAAAAAAAAAREhACAxsf/aAAgBAQABPxBpuI6HOHgknqnri7VaP//Z","sizes":"(max-width: 1498px) 100vw, 1498px","src":"/static/08f6fb742ee7092b6b1af0c725258d34/ae8ab/sunss.jpg","srcSet":"/static/08f6fb742ee7092b6b1af0c725258d34/06c2a/sunss.jpg 930w,\n/static/08f6fb742ee7092b6b1af0c725258d34/ae8ab/sunss.jpg 1498w"}}},"author":{"id":"Tom Watson","bio":"All things being even","avatar":{"children":[{"fixed":{"src":"/static/47b900bd4475f6f27735e26ac02bb5d1/fba88/icon-logo.png"}}]}}},"fields":{"layout":"post","slug":"/buildingthissite/"}},"next":{"excerpt":"Have you ever wondered what sets the best chess players a part from the rest? Or what you, as a novice of any mastery, could learn from that…","timeToRead":14,"frontmatter":{"title":"Peak: a review","tags":["review"],"date":"2019-01-19T23:46:37.121Z","excerpt":"Have you ever wondered what sets the best chess players a part from the rest? Or what you, as a novice of any mastery, could learn from that?","image":{"childImageSharp":{"fluid":{"aspectRatio":1.6957040572792363,"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAMABQDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAIDBP/EABUBAQEAAAAAAAAAAAAAAAAAAAIB/9oADAMBAAIQAxAAAAGTZ3CiOU//xAAbEAACAgMBAAAAAAAAAAAAAAAAAgExAxITQf/aAAgBAQABBQJssw2x1aSzxa//xAAXEQEAAwAAAAAAAAAAAAAAAAAAARES/9oACAEDAQE/Acwp/8QAFhEBAQEAAAAAAAAAAAAAAAAAABIB/9oACAECAQE/Aa1T/8QAGBAAAgMAAAAAAAAAAAAAAAAAEBEgMXH/2gAIAQEABj8CQp5D/8QAGhAAAwADAQAAAAAAAAAAAAAAAAERITFRQf/aAAgBAQABPyGk+6Y2WJeMVTrLYeSpdeDyUf/aAAwDAQACAAMAAAAQCx//xAAWEQEBAQAAAAAAAAAAAAAAAAABABH/2gAIAQMBAT8QMJI5f//EABURAQEAAAAAAAAAAAAAAAAAAAAB/9oACAECAQE/EBaf/8QAHBABAQEAAgMBAAAAAAAAAAAAAREAITFhgZGx/9oACAEBAAE/EESE7K9Suv0oteMp8CPzAYRQZ4yyQcuH05LEBhCb/9k=","sizes":"(max-width: 1421px) 100vw, 1421px","src":"/static/5b850f709c52e6a1be05341ce8eddecc/921b0/peak.jpg","srcSet":"/static/5b850f709c52e6a1be05341ce8eddecc/0d7cb/peak.jpg 930w,\n/static/5b850f709c52e6a1be05341ce8eddecc/921b0/peak.jpg 1421w"}}},"author":{"id":"Tom Watson","bio":"All things being even","avatar":{"children":[{"fixed":{"src":"/static/47b900bd4475f6f27735e26ac02bb5d1/fba88/icon-logo.png"}}]}}},"fields":{"layout":"post","slug":"/peak/"}}}}