{"data":{"logo":{"childImageSharp":{"fixed":{"base64":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAECAYAAACOXx+WAAAACXBIWXMAAA7EAAAOxAGVKw4bAAAA30lEQVQY022PuwrCMBhG00FRUIsKQi04iJfJC0IFxUXUQRB0EaFjW1ycfATfwIdwUJ9AbRYnSQcXX8hT7KBg4JD8+ZKTP+J2smK3s5U+7IUWyHVC+a4uvobyvYz4MwLppZT0mszaT4DQRri8HNvD531rKN+ZKukWOVjnQgka1I1AurWIHiSgyhk7+GQdaENTXE/WBuHweuysXo+djrCHoEvoIGvR4Yx6zOUc8wLCBwv8JM/eJKoHMId+2KGFcISwijCOsEKQQxh2mEWoq083dTDYqyDTIEltkpnRukxmvAF42IswAodQPwAAAABJRU5ErkJggg==","width":400,"height":89,"src":"/static/9efd9cc23dfa9a8aa5bd4f6570289133/51380/title-logo.png","srcSet":"/static/9efd9cc23dfa9a8aa5bd4f6570289133/51380/title-logo.png 1x,\n/static/9efd9cc23dfa9a8aa5bd4f6570289133/240c8/title-logo.png 1.5x,\n/static/9efd9cc23dfa9a8aa5bd4f6570289133/f5cf3/title-logo.png 2x"}}},"markdownRemark":{"html":"<p><sub>* <em>No teenager today is called Gerald.</em><sub/></p>\n<p>It is hard to pinpoint when we lost Gerald. He had been a member of our three year ‘rite of passage’ youth group from the very beginning <a href=\"https://www.steppingstonesproject.org/\">(run through the Stepping Stones Project)</a>. In someway, all the boys were ‘lost’ when they joined the group; we all are in some fashion at that age. Transitioning from the relatively simple perspective of a child, to life as a young adult, is a wild ride for most folks. Finding most of the boys took time. We  faced disruption over much of the groups existence: the wild energy of the group, boys leaving the group as a consequence of that (both disruptor and disruptees); more boys joining the group; my first co-leader leaving the group, and the transition to Chaise, my current co-leader. Gerald brought a subtle mischievous angle into the group over this time; deflections away from deeper questioning, rambolic stories in response to council prompts, ‘bonding’ that involved trolling/heckling group members past their limits. However he was not so dissimilar from the other boys that have found their peace within the group. </p>\n<blockquote>\n<p>In someway, all the boys were ‘lost’ when they joined the group; we all are in some fashion at that age.</p>\n</blockquote>\n<p><a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n    <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 32px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 100%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAUABQDASIAAhEBAxEB/8QAGAABAQEBAQAAAAAAAAAAAAAAAAIBAwT/xAAXAQADAQAAAAAAAAAAAAAAAAAAAgMB/9oADAMBAAIQAxAAAAHw3kxbgpVY0DmNP//EABsQAAMAAgMAAAAAAAAAAAAAAAECAwQSEzM0/9oACAEBAAEFAtVGORM0sAtW8izM7X7uRtTZyWYsf//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQMBAT8BH//EABoRAAEFAQAAAAAAAAAAAAAAAAABAhARMeH/2gAIAQIBAT8B6NwpI//EABsQAAMAAwEBAAAAAAAAAAAAAAABAhEhMUES/9oACAEBAAY/Apr53kiZlb6NIkjPpQp8Qm3wy+n/xAAcEAEAAwACAwAAAAAAAAAAAAABABEhEGExQaH/2gAIAQEAAT8haBPk7lVhqBFoPU+qEfZxA7GlmSyCqzIj3U//2gAMAwEAAgADAAAAEOsXw//EABgRAAIDAAAAAAAAAAAAAAAAAAABEBEx/9oACAEDAQE/EB6W4//EABkRAQEBAAMAAAAAAAAAAAAAAAEAIRFhcf/aAAgBAgEBPxA0Vdmj5dUHGF//xAAdEAEAAwACAwEAAAAAAAAAAAABABEhQVExgbGh/9oACAEBAAE/EMvqs8LcmDpVXomEIa4ocYTVfX6zSzFummz1P3HwgANIaYjcBBZKcfHUQDkNVP/Z'); background-size: cover; display: block;\"\n    ></span>\n    <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;\"\n        alt=\"break\"\n        title=\"\"\n        src=\"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg\"\n        srcset=\"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg 32w\"\n        sizes=\"(max-width: 32px) 100vw, 32px\"\n      />\n  </span>\n  </a></p>\n<p>A major purpose of the group is to hold the youths’ experiences, whatever that may be. This includes their nascent social patterns, with the hope we can allow them to be comfortable enough to reflect on those patterns in a group context. If one of the youth has some social anxiety or a relating challenge, and have formed disruptive strategies for dealing with that, the length of the group (several years) is meant to allow for this dynamic to be worked through, instead of just shutting it down and smothering it. We have made that transition with the rest of the boys in the group (not to suggest that they’ve come to terms with their challenges!). And due to a mix of circumstances, it did not work out for Gerald in the time we had.</p>\n<p>As the group was collectively dropping in deeper together over the last year, Gerald was not budging. It was difficult to see at first, but in the last half of 2018, it became more obvious. I noticed some anxiety come up for me, when thinking about Gerald’s pace of integration. We had our ‘summer trip’ booked for early October 2018 (on my birthday and anniversary weekend; another story, don’t let me start…). I knew that trip would be so critical for all the boys, getting them to land more fully into the group. Gerald had missed one of the two from our first year, something that he had jokingly turned into a bit of a complex, ‘forbidding’ discussion or references to group adventures he had missed out on. For all the boys and for Gerald in particular, I was waiting for that trip to bond us together.</p>\n<p>Around this time, Gerald had started at a new high school, of his choice. This turned out to be a decisive factor. It is a very academically focused school. Very rapidly, the pressure Gerald was placing on himself to crush academically was apparent. We started getting calls and messages from his parents that he was stressing about coming to the group; he wanted to finish his homework. We learnt that he was staying up past midnight to finish and then waking up at 6:30 am to make school the next morning.</p>\n<blockquote>\n<p>Hearing that, I was totally aghast; How could 30+ hours of homework per week be sustainable or reasonable for any teenager?!</p>\n</blockquote>\n<p>I rushed to look up what reasonable levels of homework were: there is a mix of views on the validity of homework but no one was recommending anything near that level of time spent. I made my fear and concern about Gerald’s situation known to his parents. They shared my concerns and added some more detail: a large proportion of that homework was optional. It was Gerald’s fear of ‘falling behind’ that was diving him to grind away at every piece. Gerald homework trap was largely self-inflicted. :(</p>\n<p>It was a double whammy for Gerald’s participation in the group; he would miss meetings because he was sick from the stress he was under, or just not show up if he felt too far behind on homework. And when he did show up, he was exhausted, irritated and otherwise under-resourced to deal with his social anxiety. And to top it off, he ended up getting very sick just before the summer trip, something he was already very stressed about due to the time-off he would have to take from assignments and homework. He did not make it on the trip, yet another great bonding experience for the group that Gerald had missed.</p>\n<p><a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/381ffce1b01a99817dc9bedee6484471/305c8/boysa.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n    <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 858px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 64.6853146853147%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAANABQDASIAAhEBAxEB/8QAGAAAAgMAAAAAAAAAAAAAAAAAAAECAwT/xAAWAQEBAQAAAAAAAAAAAAAAAAABAgT/2gAMAwEAAhADEAAAAd9DhnsGJ//EABYQAQEBAAAAAAAAAAAAAAAAAAEQAv/aAAgBAQABBQJum//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8BP//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQIBAT8BP//EABQQAQAAAAAAAAAAAAAAAAAAACD/2gAIAQEABj8CX//EABgQAAMBAQAAAAAAAAAAAAAAAAABEBEh/9oACAEBAAE/IWH1zA2f/9oADAMBAAIAAwAAABAUL//EABURAQEAAAAAAAAAAAAAAAAAAAEQ/9oACAEDAQE/EGf/xAAWEQEBAQAAAAAAAAAAAAAAAAAAARH/2gAIAQIBAT8QjH//xAAXEAEBAQEAAAAAAAAAAAAAAAABABEh/9oACAEBAAE/EOc9HbCUSnLb/9k='); background-size: cover; display: block;\"\n    ></span>\n    <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;\"\n        alt=\"break\"\n        title=\"\"\n        src=\"/static/381ffce1b01a99817dc9bedee6484471/305c8/boysa.jpg\"\n        srcset=\"/static/381ffce1b01a99817dc9bedee6484471/e7a69/boysa.jpg 293w,\n/static/381ffce1b01a99817dc9bedee6484471/3e6df/boysa.jpg 585w,\n/static/381ffce1b01a99817dc9bedee6484471/305c8/boysa.jpg 858w\"\n        sizes=\"(max-width: 858px) 100vw, 858px\"\n      />\n  </span>\n  </a></p>\n<p>Gerald’s journey over this time had been in stark contrast to that of the other boys in the group. With the richness of our trip to Bodega, with the fire vigil, wind swept hill and kayak adventure, and the continued dipping into council, the rest of the group have relaxed into a more open way of sharing with one another. The ability of the group to slow down and take life in has been such a blessing. This, regrettably, was not how things were for Gerald. Sharing vulnerably was unbearable for him, as he continued to be trapped in his social anxiety. His coping mechanisms for these times were… disruptive, to say the least. We tried to give applicable feedback to the group and Gerald specifically, about the limits we had for disruption, over those six months. Unfortunately, it just was not landing for Gerald. As 2018 wound down, the question of what to do with Gerald only got louder, especially when our ropes course day long, another key opportunity to bond with the group, was cancelled because of the wildfire smoke blanketing the area.</p>\n<p>This question hung over the group during the holiday break and was right on the agenda in the first fire circle of 2019, with the wider Stepping Stones community (leaders, elders and staff). The tension I was holding about Gerald’s situation was very present at this meeting. As we went around the circle with everyone’s initial check-in, I posed my role for the evening as the ‘questioner’, pondering what to do about Gerald. </p>\n<blockquote>\n<p>When the talking piece was past to Chaise, he described his role as the ‘humane executioner’. I immediately knew what he meant; removing Gerald from the group.</p>\n</blockquote>\n<p>As Chaise named that ‘role’, the reality of my deep resistance to that idea was finally uncovered. As the fire circle meeting continued, along with additional little moments of dialogue and reflection about this, this reality, of the need to remove Gerald, was fully dawning on me.</p>\n<p>An important aspect of fire circles is peer-counsel: asking for advice and wisdom from the wider Stepping Stones community. I felt time running down, without us dropping into counsel. A key community member, someone I really wanted to hear our challenge and provide wisdom, had to leave a little early. My anxiety about whether we were even going to have time to fit in counsel was building: I had to speak up as we transitioned from one activity to another.</p>\n<p>I surfaced by concern about time and not getting to counsel, and shared that I was holding a lot of tension around what we needed to share with the circle. The circle facilitators assured me that we were going to go into counsel as the last thing before we broke for the evening. After a dyad/paired exercise, it was time.</p>\n<blockquote>\n<p>I remember it being our time to share about Gerald, and as I was about to speak, feeling the full force of the realization that yes, factoring in the whole context, it really felt like the only way forward was to remove Gerald from the group.</p>\n</blockquote>\n<p>So many emotions bubbled up and ultimately out of me in that moment. I had fought so hard to keep this group together, to make it work. I really got to know and love each of these boys; each one of them is so dearly missed by the whole group when they miss out. Acknowledging in my heart that Gerald had to go generated great sadness for him, and I, at some level, felt like I was failing him by not being able to guide him to marking with the whole group. I cannot recall how much of this I covered or mentioned; I was choking up with emotion. I wanted to be present to those emotions and feel them, but also not be unable to articulate myself. I acknowledged my resistance to taking Gerald out of the group and how Chaise’s comment at the start of the fire circle had pulled the veil from my eyes. I knew, with precious little time left for the group before marking, that even if a decent solution could be attempted, that we would have to reorient the entire group experience around Gerald. It felt like we had to choose between Gerald’s experience of the group and everyone elses (including our own).</p>\n<p>It felt good to be held and counselled by that circle. Inter-generational care and wisdom being shared. Chaise got to speak his piece, less choked up than myself, and we got to consider next steps.</p>\n<p><a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n    <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 32px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 100%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAUABQDASIAAhEBAxEB/8QAGAABAQEBAQAAAAAAAAAAAAAAAAIBAwT/xAAXAQADAQAAAAAAAAAAAAAAAAAAAgMB/9oADAMBAAIQAxAAAAHw3kxbgpVY0DmNP//EABsQAAMAAgMAAAAAAAAAAAAAAAECAwQSEzM0/9oACAEBAAEFAtVGORM0sAtW8izM7X7uRtTZyWYsf//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQMBAT8BH//EABoRAAEFAQAAAAAAAAAAAAAAAAABAhARMeH/2gAIAQIBAT8B6NwpI//EABsQAAMAAwEBAAAAAAAAAAAAAAABAhEhMUES/9oACAEBAAY/Apr53kiZlb6NIkjPpQp8Qm3wy+n/xAAcEAEAAwACAwAAAAAAAAAAAAABABEhEGExQaH/2gAIAQEAAT8haBPk7lVhqBFoPU+qEfZxA7GlmSyCqzIj3U//2gAMAwEAAgADAAAAEOsXw//EABgRAAIDAAAAAAAAAAAAAAAAAAABEBEx/9oACAEDAQE/EB6W4//EABkRAQEBAAMAAAAAAAAAAAAAAAEAIRFhcf/aAAgBAgEBPxA0Vdmj5dUHGF//xAAdEAEAAwACAwEAAAAAAAAAAAABABEhQVExgbGh/9oACAEBAAE/EMvqs8LcmDpVXomEIa4ocYTVfX6zSzFummz1P3HwgANIaYjcBBZKcfHUQDkNVP/Z'); background-size: cover; display: block;\"\n    ></span>\n    <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;\"\n        alt=\"break\"\n        title=\"\"\n        src=\"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg\"\n        srcset=\"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg 32w\"\n        sizes=\"(max-width: 32px) 100vw, 32px\"\n      />\n  </span>\n  </a></p>\n<p>We actually met with the boys two days later. Boy oh boy, did Gerald strongly reinforce the need for him to transition out of the group. We played hot-seat, where each group member would sit in the ‘hot seat’ and each of us got to ask them one question, which they had to answer truthfully or pass (if the question was too much). Gerald stalled, he cross-talked, he interjected, slowing things up. He frozen when it was his chance to ask questions, he even tried to poll everyone ELSE about what question he should ask. Gerald happened to be leaving early that night, so he was hoping against hope that his departure time would arrive before he had to sit in the hot seat. Once he was the last one who had not gone up to the hot seat, he claimed that he had been the second one to go up there and thus did not need to go up there. Finally, he got up in the hot seat and we struggled through the questions asked of him… The energy of the group was shot and Gerald’s picking up of the floor mats and slinging them around became the game of the moment. As we shut that down, Gerald’s departure time came and the group collectively dropped from a frantic high to a more laid-back vibe.</p>\n<p>We ended up talking to Gerald on the phone the night after, thinking that his behavior was clearly a sign that things were rough with homework and that he resented even being in the group. On the call we asked him about his experience of the group and he was happy with it, and keen to continue being in the group. He seemed to have no idea that his behavior was disruptive (and his parents reiterated later that this was his sincere understanding of his behavior). Putting the phone down, I realized; we were not helping someone escape from a situation they did not want to be in. We were going to be pushing them out of a group they truly wanted to be a part of. </p>\n<p>We arranged to meet with Gerald’s parents. Our group elder, Pat, hosted us all on a Sunday afternoon. I knew we had to get to the point of the meeting as soon as feasible. Right out, I outlined that Chaise, Pat and myself were in agreement that Gerald had to go. Gerald’s parents were heart-broken. They both were keenly aware of the challenges Gerald faced socially with his anxiety and also the pressure he was putting himself under with school. They reiterated one of the things that drew them to Stepping Stones was the structured social space in which kids like Gerald might be able to work through the challenge of relating and attuning to others. They expressed appreciation for the care and love we showed Gerald and also some frustration that perhaps with earlier intervention, Gerald’s departure from the group would not have been inevitable. Unfortunately, we only have so much time and resources to tend to the life of the group; maybe 160 hours over the year for both co-leaders. Stepping Stones is not pitched as a space for youth who need lots of individual focus and support. This is part of the harshness we were all experiencing; we all could see how much Gerald needed support. And all recognised how the group ultimately could not contain Gerald’s challenging presence. We outlined a plan to have a Gerald attend the group one last time, in a transition ceremony to mark his time with the group. A chance to give him and the boys some measure of closure about this change in the group.</p>\n<p>After some negotiation, preparation and time, the day arrived. The group met, sans Gerald, his parents and Pat. We had let the parents know that Gerald was leaving the group and if any boys wanted to write something for Gerald, now was the time. We got some feedback from parents that the boys were not surprised something like this was happening. While we were meeting with the rest of the group, Gerald, his parents and Pat were meeting at Pat’s place for a short renegotiation council, reflecting on their relationships as parent and child. Specifically, it is to ask about things the parents and child want to leave behind and what new things to cultivate as the child emerges into young adulthood. Meanwhile the group prepared a council space and we awaited their arrival.</p>\n<p><a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n    <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 32px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 100%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAUABQDASIAAhEBAxEB/8QAGAABAQEBAQAAAAAAAAAAAAAAAAIBAwT/xAAXAQADAQAAAAAAAAAAAAAAAAAAAgMB/9oADAMBAAIQAxAAAAHw3kxbgpVY0DmNP//EABsQAAMAAgMAAAAAAAAAAAAAAAECAwQSEzM0/9oACAEBAAEFAtVGORM0sAtW8izM7X7uRtTZyWYsf//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQMBAT8BH//EABoRAAEFAQAAAAAAAAAAAAAAAAABAhARMeH/2gAIAQIBAT8B6NwpI//EABsQAAMAAwEBAAAAAAAAAAAAAAABAhEhMUES/9oACAEBAAY/Apr53kiZlb6NIkjPpQp8Qm3wy+n/xAAcEAEAAwACAwAAAAAAAAAAAAABABEhEGExQaH/2gAIAQEAAT8haBPk7lVhqBFoPU+qEfZxA7GlmSyCqzIj3U//2gAMAwEAAgADAAAAEOsXw//EABgRAAIDAAAAAAAAAAAAAAAAAAABEBEx/9oACAEDAQE/EB6W4//EABkRAQEBAAMAAAAAAAAAAAAAAAEAIRFhcf/aAAgBAgEBPxA0Vdmj5dUHGF//xAAdEAEAAwACAwEAAAAAAAAAAAABABEhQVExgbGh/9oACAEBAAE/EMvqs8LcmDpVXomEIa4ocYTVfX6zSzFummz1P3HwgANIaYjcBBZKcfHUQDkNVP/Z'); background-size: cover; display: block;\"\n    ></span>\n    <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;\"\n        alt=\"break\"\n        title=\"\"\n        src=\"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg\"\n        srcset=\"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg 32w\"\n        sizes=\"(max-width: 32px) 100vw, 32px\"\n      />\n  </span>\n  </a></p>\n<p>I am so glad that Gerald showed up. I can imagine how intense it would have been for me to have to show up to a group that I was forced to leave, as my 14 or 15 year old self. Let alone how it must have been for Gerald, with his history of social anxiety. We started with naming our intention; to honor Gerald’s time with the group and wish him well on his way. We started with an the prompt, </p>\n<blockquote>\n<p>“What is a meaningful moment you shared with Gerald during your time in the group? Or what is one hope you have for Gerald’s future?”</p>\n</blockquote>\n<p> This was everyone’s chance to say something about Gerald and it was a mix of short sweet wishes and deeper reflections on times and laughs shared. After this we returned the talking piece to the council center and offered an open witnessing prompt. We asked for anyone that felt called to take the talking piece from the circle center and share something about Gerald that they had witnessed about him over the two years he had been a part of the group. After a pause, one of the boys started us with a really sweet reflection on how nice and easy going Gerald was to be around. I reflected on a special circumstance that Gerald shared with another boy in the group, how that it was so sweet that they had got to be in the group together and that I hoped that they would get to continue their friendship. The other boy took the talking piece immediately after and also shared how special it had been to share the group with Gerald.</p>\n<p>Gerald’s parents also got to share their experiences of the group as parents, how grateful they were to the boys for sharing their heart-thoughts and feelings about Gerald. At different parts of the process, we tried to allow space for Gerald to speak to the group. He refused, even after one of his parents tried to counsel him about how they had previously practiced what he wanted to say to each of us. It was hard to see Gerald disassociating so hard at this point. It was too much for him to share. I hope that what was shared by his folks and the rest of the group really landed for him, if not on the night but later.</p>\n<p>We finished with a little gifting session, where Chaise and I both had gifts to send Gerald on his way. We close the council and we had a stilted few minutes of getting out of the solemn energy of the council. Individually we said goodbye to Gerald and he and his parents departed. It was done. We had thirty minutes and the group really wanted to jump into hot-seat for those of us that were not at the prior hot-seat meeting.</p>\n<p>It was done.</p>\n<hr>\n<p>We have so much happening in such a short time with the group. Ropes course, summer trip, renegotiation ceremony, more meetings, marking ceremony… I am excited for the deep potential of this time ahead for the group. The question of what do with Gerald has been answered, even if it still gives me a moment’s pause when I think about it.</p>","htmlAst":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"sub","properties":{},"children":[{"type":"text","value":"* "},{"type":"element","tagName":"em","properties":{},"children":[{"type":"text","value":"No teenager today is called Gerald."}]},{"type":"element","tagName":"sub","properties":{},"children":[]}]}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"It is hard to pinpoint when we lost Gerald. He had been a member of our three year ‘rite of passage’ youth group from the very beginning "},{"type":"element","tagName":"a","properties":{"href":"https://www.steppingstonesproject.org/"},"children":[{"type":"text","value":"(run through the Stepping Stones Project)"}]},{"type":"text","value":". In someway, all the boys were ‘lost’ when they joined the group; we all are in some fashion at that age. Transitioning from the relatively simple perspective of a child, to life as a young adult, is a wild ride for most folks. Finding most of the boys took time. We  faced disruption over much of the groups existence: the wild energy of the group, boys leaving the group as a consequence of that (both disruptor and disruptees); more boys joining the group; my first co-leader leaving the group, and the transition to Chaise, my current co-leader. Gerald brought a subtle mischievous angle into the group over this time; deflections away from deeper questioning, rambolic stories in response to council prompts, ‘bonding’ that involved trolling/heckling group members past their limits. However he was not so dissimilar from the other boys that have found their peace within the group. "}]},{"type":"text","value":"\n"},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"In someway, all the boys were ‘lost’ when they joined the group; we all are in some fashion at that age."}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"a","properties":{"className":["gatsby-resp-image-link"],"href":"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg","style":"display: block","target":"_blank","rel":["noopener"]},"children":[{"type":"text","value":"\n    "},{"type":"element","tagName":"span","properties":{"className":["gatsby-resp-image-wrapper"],"style":"position: relative; display: block;  max-width: 32px; margin-left: auto; margin-right: auto;"},"children":[{"type":"text","value":"\n    "},{"type":"element","tagName":"span","properties":{"className":["gatsby-resp-image-background-image"],"style":"padding-bottom: 100%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAUABQDASIAAhEBAxEB/8QAGAABAQEBAQAAAAAAAAAAAAAAAAIBAwT/xAAXAQADAQAAAAAAAAAAAAAAAAAAAgMB/9oADAMBAAIQAxAAAAHw3kxbgpVY0DmNP//EABsQAAMAAgMAAAAAAAAAAAAAAAECAwQSEzM0/9oACAEBAAEFAtVGORM0sAtW8izM7X7uRtTZyWYsf//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQMBAT8BH//EABoRAAEFAQAAAAAAAAAAAAAAAAABAhARMeH/2gAIAQIBAT8B6NwpI//EABsQAAMAAwEBAAAAAAAAAAAAAAABAhEhMUES/9oACAEBAAY/Apr53kiZlb6NIkjPpQp8Qm3wy+n/xAAcEAEAAwACAwAAAAAAAAAAAAABABEhEGExQaH/2gAIAQEAAT8haBPk7lVhqBFoPU+qEfZxA7GlmSyCqzIj3U//2gAMAwEAAgADAAAAEOsXw//EABgRAAIDAAAAAAAAAAAAAAAAAAABEBEx/9oACAEDAQE/EB6W4//EABkRAQEBAAMAAAAAAAAAAAAAAAEAIRFhcf/aAAgBAgEBPxA0Vdmj5dUHGF//xAAdEAEAAwACAwEAAAAAAAAAAAABABEhQVExgbGh/9oACAEBAAE/EMvqs8LcmDpVXomEIa4ocYTVfX6zSzFummz1P3HwgANIaYjcBBZKcfHUQDkNVP/Z'); background-size: cover; display: block;"},"children":[]},{"type":"text","value":"\n    "},{"type":"element","tagName":"img","properties":{"className":["gatsby-resp-image-image"],"style":"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;","alt":"break","title":"","src":"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg","srcSet":["/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg 32w"],"sizes":["(max-width:","32px)","100vw,","32px"]},"children":[]},{"type":"text","value":"\n  "}]},{"type":"text","value":"\n  "}]}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"A major purpose of the group is to hold the youths’ experiences, whatever that may be. This includes their nascent social patterns, with the hope we can allow them to be comfortable enough to reflect on those patterns in a group context. If one of the youth has some social anxiety or a relating challenge, and have formed disruptive strategies for dealing with that, the length of the group (several years) is meant to allow for this dynamic to be worked through, instead of just shutting it down and smothering it. We have made that transition with the rest of the boys in the group (not to suggest that they’ve come to terms with their challenges!). And due to a mix of circumstances, it did not work out for Gerald in the time we had."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"As the group was collectively dropping in deeper together over the last year, Gerald was not budging. It was difficult to see at first, but in the last half of 2018, it became more obvious. I noticed some anxiety come up for me, when thinking about Gerald’s pace of integration. We had our ‘summer trip’ booked for early October 2018 (on my birthday and anniversary weekend; another story, don’t let me start…). I knew that trip would be so critical for all the boys, getting them to land more fully into the group. Gerald had missed one of the two from our first year, something that he had jokingly turned into a bit of a complex, ‘forbidding’ discussion or references to group adventures he had missed out on. For all the boys and for Gerald in particular, I was waiting for that trip to bond us together."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Around this time, Gerald had started at a new high school, of his choice. This turned out to be a decisive factor. It is a very academically focused school. Very rapidly, the pressure Gerald was placing on himself to crush academically was apparent. We started getting calls and messages from his parents that he was stressing about coming to the group; he wanted to finish his homework. We learnt that he was staying up past midnight to finish and then waking up at 6:30 am to make school the next morning."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Hearing that, I was totally aghast; How could 30+ hours of homework per week be sustainable or reasonable for any teenager?!"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I rushed to look up what reasonable levels of homework were: there is a mix of views on the validity of homework but no one was recommending anything near that level of time spent. I made my fear and concern about Gerald’s situation known to his parents. They shared my concerns and added some more detail: a large proportion of that homework was optional. It was Gerald’s fear of ‘falling behind’ that was diving him to grind away at every piece. Gerald homework trap was largely self-inflicted. :("}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"It was a double whammy for Gerald’s participation in the group; he would miss meetings because he was sick from the stress he was under, or just not show up if he felt too far behind on homework. And when he did show up, he was exhausted, irritated and otherwise under-resourced to deal with his social anxiety. And to top it off, he ended up getting very sick just before the summer trip, something he was already very stressed about due to the time-off he would have to take from assignments and homework. He did not make it on the trip, yet another great bonding experience for the group that Gerald had missed."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"a","properties":{"className":["gatsby-resp-image-link"],"href":"/static/381ffce1b01a99817dc9bedee6484471/305c8/boysa.jpg","style":"display: block","target":"_blank","rel":["noopener"]},"children":[{"type":"text","value":"\n    "},{"type":"element","tagName":"span","properties":{"className":["gatsby-resp-image-wrapper"],"style":"position: relative; display: block;  max-width: 858px; margin-left: auto; margin-right: auto;"},"children":[{"type":"text","value":"\n    "},{"type":"element","tagName":"span","properties":{"className":["gatsby-resp-image-background-image"],"style":"padding-bottom: 64.6853146853147%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAANABQDASIAAhEBAxEB/8QAGAAAAgMAAAAAAAAAAAAAAAAAAAECAwT/xAAWAQEBAQAAAAAAAAAAAAAAAAABAgT/2gAMAwEAAhADEAAAAd9DhnsGJ//EABYQAQEBAAAAAAAAAAAAAAAAAAEQAv/aAAgBAQABBQJum//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8BP//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQIBAT8BP//EABQQAQAAAAAAAAAAAAAAAAAAACD/2gAIAQEABj8CX//EABgQAAMBAQAAAAAAAAAAAAAAAAABEBEh/9oACAEBAAE/IWH1zA2f/9oADAMBAAIAAwAAABAUL//EABURAQEAAAAAAAAAAAAAAAAAAAEQ/9oACAEDAQE/EGf/xAAWEQEBAQAAAAAAAAAAAAAAAAAAARH/2gAIAQIBAT8QjH//xAAXEAEBAQEAAAAAAAAAAAAAAAABABEh/9oACAEBAAE/EOc9HbCUSnLb/9k='); background-size: cover; display: block;"},"children":[]},{"type":"text","value":"\n    "},{"type":"element","tagName":"img","properties":{"className":["gatsby-resp-image-image"],"style":"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;","alt":"break","title":"","src":"/static/381ffce1b01a99817dc9bedee6484471/305c8/boysa.jpg","srcSet":["/static/381ffce1b01a99817dc9bedee6484471/e7a69/boysa.jpg 293w","/static/381ffce1b01a99817dc9bedee6484471/3e6df/boysa.jpg 585w","/static/381ffce1b01a99817dc9bedee6484471/305c8/boysa.jpg 858w"],"sizes":["(max-width:","858px)","100vw,","858px"]},"children":[]},{"type":"text","value":"\n  "}]},{"type":"text","value":"\n  "}]}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Gerald’s journey over this time had been in stark contrast to that of the other boys in the group. With the richness of our trip to Bodega, with the fire vigil, wind swept hill and kayak adventure, and the continued dipping into council, the rest of the group have relaxed into a more open way of sharing with one another. The ability of the group to slow down and take life in has been such a blessing. This, regrettably, was not how things were for Gerald. Sharing vulnerably was unbearable for him, as he continued to be trapped in his social anxiety. His coping mechanisms for these times were… disruptive, to say the least. We tried to give applicable feedback to the group and Gerald specifically, about the limits we had for disruption, over those six months. Unfortunately, it just was not landing for Gerald. As 2018 wound down, the question of what to do with Gerald only got louder, especially when our ropes course day long, another key opportunity to bond with the group, was cancelled because of the wildfire smoke blanketing the area."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"This question hung over the group during the holiday break and was right on the agenda in the first fire circle of 2019, with the wider Stepping Stones community (leaders, elders and staff). The tension I was holding about Gerald’s situation was very present at this meeting. As we went around the circle with everyone’s initial check-in, I posed my role for the evening as the ‘questioner’, pondering what to do about Gerald. "}]},{"type":"text","value":"\n"},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"When the talking piece was past to Chaise, he described his role as the ‘humane executioner’. I immediately knew what he meant; removing Gerald from the group."}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"As Chaise named that ‘role’, the reality of my deep resistance to that idea was finally uncovered. As the fire circle meeting continued, along with additional little moments of dialogue and reflection about this, this reality, of the need to remove Gerald, was fully dawning on me."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"An important aspect of fire circles is peer-counsel: asking for advice and wisdom from the wider Stepping Stones community. I felt time running down, without us dropping into counsel. A key community member, someone I really wanted to hear our challenge and provide wisdom, had to leave a little early. My anxiety about whether we were even going to have time to fit in counsel was building: I had to speak up as we transitioned from one activity to another."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I surfaced by concern about time and not getting to counsel, and shared that I was holding a lot of tension around what we needed to share with the circle. The circle facilitators assured me that we were going to go into counsel as the last thing before we broke for the evening. After a dyad/paired exercise, it was time."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I remember it being our time to share about Gerald, and as I was about to speak, feeling the full force of the realization that yes, factoring in the whole context, it really felt like the only way forward was to remove Gerald from the group."}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"So many emotions bubbled up and ultimately out of me in that moment. I had fought so hard to keep this group together, to make it work. I really got to know and love each of these boys; each one of them is so dearly missed by the whole group when they miss out. Acknowledging in my heart that Gerald had to go generated great sadness for him, and I, at some level, felt like I was failing him by not being able to guide him to marking with the whole group. I cannot recall how much of this I covered or mentioned; I was choking up with emotion. I wanted to be present to those emotions and feel them, but also not be unable to articulate myself. I acknowledged my resistance to taking Gerald out of the group and how Chaise’s comment at the start of the fire circle had pulled the veil from my eyes. I knew, with precious little time left for the group before marking, that even if a decent solution could be attempted, that we would have to reorient the entire group experience around Gerald. It felt like we had to choose between Gerald’s experience of the group and everyone elses (including our own)."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"It felt good to be held and counselled by that circle. Inter-generational care and wisdom being shared. Chaise got to speak his piece, less choked up than myself, and we got to consider next steps."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"a","properties":{"className":["gatsby-resp-image-link"],"href":"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg","style":"display: block","target":"_blank","rel":["noopener"]},"children":[{"type":"text","value":"\n    "},{"type":"element","tagName":"span","properties":{"className":["gatsby-resp-image-wrapper"],"style":"position: relative; display: block;  max-width: 32px; margin-left: auto; margin-right: auto;"},"children":[{"type":"text","value":"\n    "},{"type":"element","tagName":"span","properties":{"className":["gatsby-resp-image-background-image"],"style":"padding-bottom: 100%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAUABQDASIAAhEBAxEB/8QAGAABAQEBAQAAAAAAAAAAAAAAAAIBAwT/xAAXAQADAQAAAAAAAAAAAAAAAAAAAgMB/9oADAMBAAIQAxAAAAHw3kxbgpVY0DmNP//EABsQAAMAAgMAAAAAAAAAAAAAAAECAwQSEzM0/9oACAEBAAEFAtVGORM0sAtW8izM7X7uRtTZyWYsf//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQMBAT8BH//EABoRAAEFAQAAAAAAAAAAAAAAAAABAhARMeH/2gAIAQIBAT8B6NwpI//EABsQAAMAAwEBAAAAAAAAAAAAAAABAhEhMUES/9oACAEBAAY/Apr53kiZlb6NIkjPpQp8Qm3wy+n/xAAcEAEAAwACAwAAAAAAAAAAAAABABEhEGExQaH/2gAIAQEAAT8haBPk7lVhqBFoPU+qEfZxA7GlmSyCqzIj3U//2gAMAwEAAgADAAAAEOsXw//EABgRAAIDAAAAAAAAAAAAAAAAAAABEBEx/9oACAEDAQE/EB6W4//EABkRAQEBAAMAAAAAAAAAAAAAAAEAIRFhcf/aAAgBAgEBPxA0Vdmj5dUHGF//xAAdEAEAAwACAwEAAAAAAAAAAAABABEhQVExgbGh/9oACAEBAAE/EMvqs8LcmDpVXomEIa4ocYTVfX6zSzFummz1P3HwgANIaYjcBBZKcfHUQDkNVP/Z'); background-size: cover; display: block;"},"children":[]},{"type":"text","value":"\n    "},{"type":"element","tagName":"img","properties":{"className":["gatsby-resp-image-image"],"style":"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;","alt":"break","title":"","src":"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg","srcSet":["/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg 32w"],"sizes":["(max-width:","32px)","100vw,","32px"]},"children":[]},{"type":"text","value":"\n  "}]},{"type":"text","value":"\n  "}]}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"We actually met with the boys two days later. Boy oh boy, did Gerald strongly reinforce the need for him to transition out of the group. We played hot-seat, where each group member would sit in the ‘hot seat’ and each of us got to ask them one question, which they had to answer truthfully or pass (if the question was too much). Gerald stalled, he cross-talked, he interjected, slowing things up. He frozen when it was his chance to ask questions, he even tried to poll everyone ELSE about what question he should ask. Gerald happened to be leaving early that night, so he was hoping against hope that his departure time would arrive before he had to sit in the hot seat. Once he was the last one who had not gone up to the hot seat, he claimed that he had been the second one to go up there and thus did not need to go up there. Finally, he got up in the hot seat and we struggled through the questions asked of him… The energy of the group was shot and Gerald’s picking up of the floor mats and slinging them around became the game of the moment. As we shut that down, Gerald’s departure time came and the group collectively dropped from a frantic high to a more laid-back vibe."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"We ended up talking to Gerald on the phone the night after, thinking that his behavior was clearly a sign that things were rough with homework and that he resented even being in the group. On the call we asked him about his experience of the group and he was happy with it, and keen to continue being in the group. He seemed to have no idea that his behavior was disruptive (and his parents reiterated later that this was his sincere understanding of his behavior). Putting the phone down, I realized; we were not helping someone escape from a situation they did not want to be in. We were going to be pushing them out of a group they truly wanted to be a part of. "}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"We arranged to meet with Gerald’s parents. Our group elder, Pat, hosted us all on a Sunday afternoon. I knew we had to get to the point of the meeting as soon as feasible. Right out, I outlined that Chaise, Pat and myself were in agreement that Gerald had to go. Gerald’s parents were heart-broken. They both were keenly aware of the challenges Gerald faced socially with his anxiety and also the pressure he was putting himself under with school. They reiterated one of the things that drew them to Stepping Stones was the structured social space in which kids like Gerald might be able to work through the challenge of relating and attuning to others. They expressed appreciation for the care and love we showed Gerald and also some frustration that perhaps with earlier intervention, Gerald’s departure from the group would not have been inevitable. Unfortunately, we only have so much time and resources to tend to the life of the group; maybe 160 hours over the year for both co-leaders. Stepping Stones is not pitched as a space for youth who need lots of individual focus and support. This is part of the harshness we were all experiencing; we all could see how much Gerald needed support. And all recognised how the group ultimately could not contain Gerald’s challenging presence. We outlined a plan to have a Gerald attend the group one last time, in a transition ceremony to mark his time with the group. A chance to give him and the boys some measure of closure about this change in the group."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"After some negotiation, preparation and time, the day arrived. The group met, sans Gerald, his parents and Pat. We had let the parents know that Gerald was leaving the group and if any boys wanted to write something for Gerald, now was the time. We got some feedback from parents that the boys were not surprised something like this was happening. While we were meeting with the rest of the group, Gerald, his parents and Pat were meeting at Pat’s place for a short renegotiation council, reflecting on their relationships as parent and child. Specifically, it is to ask about things the parents and child want to leave behind and what new things to cultivate as the child emerges into young adulthood. Meanwhile the group prepared a council space and we awaited their arrival."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"a","properties":{"className":["gatsby-resp-image-link"],"href":"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg","style":"display: block","target":"_blank","rel":["noopener"]},"children":[{"type":"text","value":"\n    "},{"type":"element","tagName":"span","properties":{"className":["gatsby-resp-image-wrapper"],"style":"position: relative; display: block;  max-width: 32px; margin-left: auto; margin-right: auto;"},"children":[{"type":"text","value":"\n    "},{"type":"element","tagName":"span","properties":{"className":["gatsby-resp-image-background-image"],"style":"padding-bottom: 100%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAUABQDASIAAhEBAxEB/8QAGAABAQEBAQAAAAAAAAAAAAAAAAIBAwT/xAAXAQADAQAAAAAAAAAAAAAAAAAAAgMB/9oADAMBAAIQAxAAAAHw3kxbgpVY0DmNP//EABsQAAMAAgMAAAAAAAAAAAAAAAECAwQSEzM0/9oACAEBAAEFAtVGORM0sAtW8izM7X7uRtTZyWYsf//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQMBAT8BH//EABoRAAEFAQAAAAAAAAAAAAAAAAABAhARMeH/2gAIAQIBAT8B6NwpI//EABsQAAMAAwEBAAAAAAAAAAAAAAABAhEhMUES/9oACAEBAAY/Apr53kiZlb6NIkjPpQp8Qm3wy+n/xAAcEAEAAwACAwAAAAAAAAAAAAABABEhEGExQaH/2gAIAQEAAT8haBPk7lVhqBFoPU+qEfZxA7GlmSyCqzIj3U//2gAMAwEAAgADAAAAEOsXw//EABgRAAIDAAAAAAAAAAAAAAAAAAABEBEx/9oACAEDAQE/EB6W4//EABkRAQEBAAMAAAAAAAAAAAAAAAEAIRFhcf/aAAgBAgEBPxA0Vdmj5dUHGF//xAAdEAEAAwACAwEAAAAAAAAAAAABABEhQVExgbGh/9oACAEBAAE/EMvqs8LcmDpVXomEIa4ocYTVfX6zSzFummz1P3HwgANIaYjcBBZKcfHUQDkNVP/Z'); background-size: cover; display: block;"},"children":[]},{"type":"text","value":"\n    "},{"type":"element","tagName":"img","properties":{"className":["gatsby-resp-image-image"],"style":"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;","alt":"break","title":"","src":"/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg","srcSet":["/static/518bcb7b2b6c3d418f39962492f9eac8/55780/icon.jpg 32w"],"sizes":["(max-width:","32px)","100vw,","32px"]},"children":[]},{"type":"text","value":"\n  "}]},{"type":"text","value":"\n  "}]}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I am so glad that Gerald showed up. I can imagine how intense it would have been for me to have to show up to a group that I was forced to leave, as my 14 or 15 year old self. Let alone how it must have been for Gerald, with his history of social anxiety. We started with naming our intention; to honor Gerald’s time with the group and wish him well on his way. We started with an the prompt, "}]},{"type":"text","value":"\n"},{"type":"element","tagName":"blockquote","properties":{},"children":[{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"“What is a meaningful moment you shared with Gerald during your time in the group? Or what is one hope you have for Gerald’s future?”"}]},{"type":"text","value":"\n"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":" This was everyone’s chance to say something about Gerald and it was a mix of short sweet wishes and deeper reflections on times and laughs shared. After this we returned the talking piece to the council center and offered an open witnessing prompt. We asked for anyone that felt called to take the talking piece from the circle center and share something about Gerald that they had witnessed about him over the two years he had been a part of the group. After a pause, one of the boys started us with a really sweet reflection on how nice and easy going Gerald was to be around. I reflected on a special circumstance that Gerald shared with another boy in the group, how that it was so sweet that they had got to be in the group together and that I hoped that they would get to continue their friendship. The other boy took the talking piece immediately after and also shared how special it had been to share the group with Gerald."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Gerald’s parents also got to share their experiences of the group as parents, how grateful they were to the boys for sharing their heart-thoughts and feelings about Gerald. At different parts of the process, we tried to allow space for Gerald to speak to the group. He refused, even after one of his parents tried to counsel him about how they had previously practiced what he wanted to say to each of us. It was hard to see Gerald disassociating so hard at this point. It was too much for him to share. I hope that what was shared by his folks and the rest of the group really landed for him, if not on the night but later."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"We finished with a little gifting session, where Chaise and I both had gifts to send Gerald on his way. We close the council and we had a stilted few minutes of getting out of the solemn energy of the council. Individually we said goodbye to Gerald and he and his parents departed. It was done. We had thirty minutes and the group really wanted to jump into hot-seat for those of us that were not at the prior hot-seat meeting."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"It was done."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"hr","properties":{},"children":[]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"We have so much happening in such a short time with the group. Ropes course, summer trip, renegotiation ceremony, more meetings, marking ceremony… I am excited for the deep potential of this time ahead for the group. The question of what do with Gerald has been answered, even if it still gives me a moment’s pause when I think about it."}]}],"data":{"quirksMode":false}},"excerpt":"*  No teenager today is called Gerald. It is hard to pinpoint when we lost Gerald. He had been a member of our three year ‘rite of passage…","timeToRead":12,"frontmatter":{"title":"Losing Gerald*","userDate":"26 February 2019","date":"2019-02-26T15:11:55.000Z","tags":["rites of passage"],"image":{"childImageSharp":{"fluid":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAANABQDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAIDBP/EABYBAQEBAAAAAAAAAAAAAAAAAAIAAf/aAAwDAQACEAMQAAABmuRzWMxi/8QAGxAAAQQDAAAAAAAAAAAAAAAAAgABAxEhIjL/2gAIAQEAAQUCkHdW4oye+o2PH//EABURAQEAAAAAAAAAAAAAAAAAAAAR/9oACAEDAQE/AUf/xAAXEQADAQAAAAAAAAAAAAAAAAAAAREh/9oACAECAQE/AVWaf//EABkQAAMBAQEAAAAAAAAAAAAAAAABIRECIv/aAAgBAQAGPwLNKoee2IWlp//EABwQAAICAgMAAAAAAAAAAAAAAAERAEExUSFxkf/aAAgBAQABPyEAzNQICxw9TCQ7ixYZcLPKzKj1P//aAAwDAQACAAMAAAAQNO//xAAXEQEAAwAAAAAAAAAAAAAAAAAAESFB/9oACAEDAQE/EK1F/8QAFxEBAAMAAAAAAAAAAAAAAAAAARARQf/aAAgBAgEBPxAUJsP/xAAdEAEAAgICAwAAAAAAAAAAAAABADERIUFxgZHR/9oACAEBAAE/EHh2myCL3GhXwFPUXpL2AvsxC6cpsWpq8SsuOAyuFoYqf//Z","aspectRatio":1.5574136008918618,"src":"/static/5c0eba56452a1712f8fac8316f155e21/6da92/boys.jpg","srcSet":"/static/5c0eba56452a1712f8fac8316f155e21/36363/boys.jpg 930w,\n/static/5c0eba56452a1712f8fac8316f155e21/6da92/boys.jpg 1397w","sizes":"(max-width: 1397px) 100vw, 1397px"}}},"author":{"id":"Tom Watson","bio":"All things being even","avatar":{"children":[{"__typename":"ImageSharp","fixed":{"base64":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAUCAYAAACNiR0NAAAACXBIWXMAAA7EAAAOxAGVKw4bAAABkElEQVQ4y82Uy0sCURTG3ZQ9fGQ6T8eZyEwdrdHIMKWw/oFoE9UiIqJcFFJWaA8KiR5CGbQooVzUov7Lr7m3dCFSoxm0+Jh77uM353K+e0ysk0c7ZfpzINPPGT5M9tbvNzVadDk4KhJXx43mGiXRMEOR4+ERBPDM51ci4oXaHIndevxthkSci4fdymJtyYdSYQQxzYPFOS+ujkK41LW6MISgz42LfAjZdMAY0GZhsbsZwHs5imRMRiQk4elGQ6WkITEuQ9WBlTuNQg0DM+t+vNxHkEoo6OpkkNsK4jSrwtLD0h88FkdR2FebA77qwBkdaNaBUxMyUpMKus0MomEJZQI8aAFIIHY95r6K5bBxNMPfA11tAtIrdzCYjiuYTf7yyrWi6JD8dhBneyqsvS0WZWfDj7eHKLUJyahqG2Ij4sPnWw3nuZBxY6dXhum14mMylue9KJ6EcX0cpoYP+93U9IeZ4M/A6tOTRQFeRaRPsFoQIjIWWB6DsogBSWiuOTj7uNpcvcgakeHm0Jb29W879gejxi05rmT8GwAAAABJRU5ErkJggg==","width":400,"height":400,"src":"/static/47b900bd4475f6f27735e26ac02bb5d1/fba88/icon-logo.png","srcSet":"/static/47b900bd4475f6f27735e26ac02bb5d1/fba88/icon-logo.png 1x,\n/static/47b900bd4475f6f27735e26ac02bb5d1/1d604/icon-logo.png 1.5x"}}]}}}},"relatedPosts":{"totalCount":2,"edges":[{"node":{"id":"8f419afe-bc35-5b8c-9735-9980f740018c","timeToRead":3,"excerpt":"Epistemic status: Reflective, anecdotal I just spent my birthday hiking up a windswept hill with my youth group, of teenage boys, and my…","frontmatter":{"title":"Returning from the Bodega Bay Summer Trip"},"fields":{"slug":"/ritesofpassage/bodega/"}}},{"node":{"id":"50218099-7cb0-5b13-a9a9-7ff1246a9d80","timeToRead":12,"excerpt":"*  No teenager today is called Gerald. It is hard to pinpoint when we lost Gerald. He had been a member of our three year ‘rite of passage…","frontmatter":{"title":"Losing Gerald*"},"fields":{"slug":"/ritesofpassage/losing-gerald/"}}}]}},"pageContext":{"slug":"/ritesofpassage/losing-gerald/","prev":{"excerpt":"I am going to dive into outlining a generic mental model for what organizations tend to do when they have geo-data acquisition needs. A…","timeToRead":10,"frontmatter":{"title":"A generic mental model for geo-data acquisition","tags":[],"date":"2019-02-16T23:46:37.121Z","image":{"childImageSharp":{"fluid":{"aspectRatio":1.7814432989690723,"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAALABQDASIAAhEBAxEB/8QAGAAAAwEBAAAAAAAAAAAAAAAAAAQFAwb/xAAWAQEBAQAAAAAAAAAAAAAAAAAAAgP/2gAMAwEAAhADEAAAAWGuY0zu6QA//8QAGRAAAgMBAAAAAAAAAAAAAAAAAQMABBAR/9oACAEBAAEFAhaVA9fDZXBv/8QAFhEBAQEAAAAAAAAAAAAAAAAAAQAR/9oACAEDAQE/AQLC/8QAFREBAQAAAAAAAAAAAAAAAAAAARD/2gAIAQIBAT8BZ//EABcQAAMBAAAAAAAAAAAAAAAAAAAgQTH/2gAIAQEABj8CppU//8QAHBAAAgAHAAAAAAAAAAAAAAAAAAERMUFRgZGx/9oACAEBAAE/IXLMDkXAi56ClBn/2gAMAwEAAgADAAAAEBs//8QAFxEAAwEAAAAAAAAAAAAAAAAAAAEhYf/aAAgBAwEBPxBpUyP/xAAYEQADAQEAAAAAAAAAAAAAAAAAARFBUf/aAAgBAgEBPxCsZH0//8QAGxABAAICAwAAAAAAAAAAAAAAAQARIXExYdH/2gAIAQEAAT8QrLN49lP1O4el2pDmswUILTBmf//Z","sizes":"(max-width: 864px) 100vw, 864px","src":"/static/e8b2ed543f06ae7589919c2392ed2d3b/ab9cf/sun.jpg","srcSet":"/static/e8b2ed543f06ae7589919c2392ed2d3b/ab9cf/sun.jpg 864w"}}},"author":{"id":"Tom Watson","bio":"All things being even","avatar":{"children":[{"fixed":{"src":"/static/47b900bd4475f6f27735e26ac02bb5d1/fba88/icon-logo.png"}}]}}},"fields":{"layout":"post","slug":"/data-acquisition/"}},"next":null,"primaryTag":"rites of passage"}}